{
  "recipes": [
    {
      "name": "Creamed Greens Pie",
      "author": "Erin McDowell",
      "author_url": "https://food52.com/users/3572-erin-mcdowell",
      "date": "November 6, 2016",
      "description": "This pie is great on it's own, but it's even better as part of the epic Three-Tier Thanksgiving Dinner Pie (https://food52.com/recipes...)! —Erin McDowell",
      "ingredients": [
        {
          "ingredient": "6 ounces pancetta, diced"
        },
        {
          "ingredient": "5 shallots, diced"
        },
        {
          "ingredient": "4 cloves garlic, minced"
        },
        {
          "ingredient": "4 bunches kale, roughly torn"
        },
        {
          "ingredient": "Salt and freshly ground black pepper"
        },
        {
          "ingredient": "pinch red pepper flakes"
        },
        {
          "ingredient": "1/2 cup white wine"
        },
        {
          "ingredient": "1 tablespoon fresh chopped rosemary"
        },
        {
          "ingredient": "3/4 cup heavy cream"
        },
        {
          "ingredient": "1 cup walnuts, chopped"
        },
        {
          "ingredient": "1 recipe Hot Water Crust (https://food52.com/recipes...)"
        }
      ],
      "directions": [
        {
          "step": "In a large pot, heat the pancetta over medium heat. Cook until the fat has rendered and it’s golden brown, 5-6 minutes."
        },
        {
          "step": "Add the shallots and sauté until tender, 2-3 minutes. Stir in the garlic and sauté until fragrant, 1 minute more."
        },
        {
          "step": "Add the kale in batches—adding handfuls and sautéing until it wilts. Once all the kale is added, season with salt, pepper, and red pepper flakes."
        },
        {
          "step": "Add the wine to the pan and sauté until it evaporates, 6-8 minutes. Stir in the rosemary."
        },
        {
          "step": "Add the heavy cream and bring to a simmer. Simmer until the mixture thickens slightly, 5-6 minutes more. Stir in the walnuts."
        },
        {
          "step": "Preheat the oven to 375°F. Line a baking sheet with parchment paper and place a 9 inch springform pan on it."
        },
        {
          "step": "Prepare the Hot Water Crust as directed by the recipe, then divide into two pieces—one about 2/3 of the dough (for the base and sides) and one about 1/3 of the dough (for the top)."
        },
        {
          "step": "Start with the larger piece for the base and sides. Remember, you have to work with the crust while it’s hot to keep it pliable. I like to roll it out as best I can between two sheets of plastic wrap to about 1/4 inch thick (a little thicker is OK, too)."
        },
        {
          "step": "Peel the top piece of plastic wrap off, then use the bottom piece to help you invert the dough into the springform pan. Don’t worry if it tears or small holes appear—you can patch it! Patch any holes, tears, or uncovered areas with more dough, and press well to ensure they’re sealed. (Alternatively, you can just press the crust in from the get go— just remember to work quickly!)"
        },
        {
          "step": "Pour the filling into the pan and spread into an even layer. Transfer the springform pan back to the parchment lined baking sheet."
        },
        {
          "step": "Roll out the remaining dough between two sheets of plastic wrap to about 1/4 inch thick. Peel off the top piece of plastic wrap then use the bottom piece to help you invert the crust on top of the filling, then peel it away."
        },
        {
          "step": "Pinch the two crusts together at the sides, and pinch off any excess. Crimp the edges as desired to make sure they’re sealed together."
        },
        {
          "step": "Use the handle of a wooden spoon to make a vent in the center of the pie. Bake the pie until the crust is golden brown and steam is coming out of the vent, 40-45 minutes. Cool at least 15 minutes before unmolding, slicing, and serving."
        }
      ]
    },
    {
      "name": "Sweet Roasted Chestnuts with Vanilla and Fennel",
      "author": "Caroline Lange",
      "author_url": "https://food52.com/users/186158-caroline-lange",
      "date": "November 4, 2016",
      "description": "Spoon these chestnuts—roasted with similarly earthy-sweet fennel seeds—over ice cream or oatmeal or (my favorite) tangy yogurt. They're melty, rich, a little chewy, and the buttery, chestnutty sauce is the best part. Roast them in a parchment paper bag and not only do you have approximately zero things to clean up, but it's also super easy to collect the syrup they roast in.\nAlso: Jarred chestnuts are great! No need to roast and peel your own, though you're certainly more than welcome to. Just make sure to get ones that are packed in water (or are vacuum-packed) rather than in syrup. —Caroline Lange",
      "ingredients": [
        {
          "ingredient": "1 14.8-oz. jar roasted, peeled chestnuts (or about 1 pound chestnuts you've roasted and peeled yourself)"
        },
        {
          "ingredient": "6 tablespoons unsalted butter"
        },
        {
          "ingredient": "1/4 cup maple syrup"
        },
        {
          "ingredient": "1 teaspoon fennel seeds"
        },
        {
          "ingredient": "1 vanilla bean, scraped (or 1 1/2 teaspoons pure vanilla extract)"
        },
        {
          "ingredient": "A good pinch of salt"
        },
        {
          "ingredient": "1 cup water"
        }
      ],
      "directions": [
        {
          "step": "Preheat your oven to 375° F and prepare a baking sheet with a parchment roasting bag (or make a big envelope out of parchment paper)."
        },
        {
          "step": "If your chestnuts come packed in water, drain and rinse them. Transfer them to a cutting board and give them a very rough chop—really, just break them up. Add them to the bag."
        },
        {
          "step": "Add the butter, maple syrup, fennel seeds, vanilla bean seeds (I like to include the bean itself, too—it's pretty, and holds vanilla flavor itself), salt, and water to the bag. Seal or pinch the bag closed and slide into the preheated oven."
        },
        {
          "step": "After 5 minutes, carefully use tongs to give the bag a good shake, distributing the (now melted) butter with the chestnuts and spices. Roast for another 15 to 20 minutes, until the chestnuts have softened a bit."
        },
        {
          "step": "Remove the pan and let rest 5 or so minutes before opening. Taste for salt and add a pinch more, if you like. Pour the chestnuts and sauce into a bowl and serve immediately (especially over tangy yogurt or vanilla ice cream!) or pack into a jar and refrigerate for up to a week."
        },
        {
          "step": "To reheat the chestnuts, warm in a pan over very low heat with a splash of water, tossing them often."
        }
      ]
    },
    {
      "name": "Bittersweet Brownie Drops",
      "author": "Alice Medrich",
      "author_url": "https://food52.com/users/64637-alice-medrich",
      "date": "November 3, 2016",
      "description": "Here’s an easy ultra chocolaty drop cookie laced with chips or chunks of any kind of chocolate you like—white, milk, or dark. Follow the slightly quirky mixing instructions and take cookies out of the oven when they are still soft to the touch; they will firm up as they cool and but remain moist slightly gooey. —Alice Medrich",
      "ingredients": [
        {
          "ingredient": "4 tablespoons (30 grams) unsalted butter"
        },
        {
          "ingredient": "8 ounces (225 grams) dark chocolate with 70%-72% cacao"
        },
        {
          "ingredient": "1/3 cup plus 1 tablespoon (50 grams) gluten-free flour"
        },
        {
          "ingredient": "1/8 teaspoon baking soda"
        },
        {
          "ingredient": "1/4 teaspoon salt"
        },
        {
          "ingredient": "3/4 cup plus 2 tablespoons sugar (175 grams) sugar"
        },
        {
          "ingredient": "1/2 teaspoon pure vanilla extract"
        },
        {
          "ingredient": "2 large cold eggs"
        },
        {
          "ingredient": "1 cup (115 grams) walnut or pecan pieces, broken or very coarsely chopped"
        },
        {
          "ingredient": "6 ounces (170 grams) chocolate chips or chunks"
        }
      ],
      "directions": [
        {
          "step": "Preheat the oven to 350°F. Position racks in the upper and lower thirds of the oven."
        },
        {
          "step": "Melt the butter with the chocolate in a medium stainless steel bowl set directly in a wider skillet of barely simmering water. Stir frequently until the mixture is melted and smooth and fairly hot to the touch."
        },
        {
          "step": "Meanwhile, mix the flour, baking soda, and salt together thoroughly and set it aside."
        },
        {
          "step": "Remove the chocolate bowl from the water bath. Stir in the sugar and vanilla. Add 1 egg, and stir briskly until it is incorporated. Repeat with the second egg. Add the flour mixture and stir until you can no longer see it. Stir the batter vigorously with a wooden spoon or spatula until it is smooth and shiny and pulls away from the sides of the bowl. It may start to slide around the bowl as you stir—just keep stirring until it is thick and cohesive and no longer slides in the bowl. Stir for a few more seconds for good measure. Be sure the batter is completely cool to the touch, and then stir in the nuts and chocolate pieces."
        },
        {
          "step": "Scoop slightly rounded tablespoons of batter 2 inches apart on parchment-lined baking sheets. Scoop all of the batter onto the parchment sheets right away, rather than letting it wait in the bowl, even if you are baking later. Bake 10 to 12 minutes or until the cookies are puffed and a little crackled on the surface and feel soft and tender—but not squishy— when touched with a fingertip. Rotate the sheets from upper to lower and front to back about halfway through the time to insure even baking. The cookies will firm up as they cool."
        },
        {
          "step": "Set the pan on racks to cool, or slide the pan liners from the baking sheets on the racks. Cookies keep in an airtight container for 2 to 3 days."
        }
      ]
    },
    {
      "name": "Pasta e Fagioli (Pasta and Beans)",
      "author": "Emiko",
      "author_url": "https://food52.com/users/23872-emiko",
      "date": "November 1, 2016",
      "description": "Pasta e fagioli varies from region to region and even household to household and generation to generation, but the idea is the same: Cooked beans (better, of course, if you cook them yourself from dried or fresh beans, but, otherwise, a can will do), partially reduced to a thick and creamy puree, are cooked with some tomato puree, enough to make it blush. This thick sauce of whole and pureed beans with short pasta swimming in it is somewhat halfway between a soup and a pasta dish, suitable for eating with a spoon.\nWhat changes are the other additions—sometimes this is cooked with a soffritto of celery, onion and carrot and other times with finely chopped garlic and parsley as its base.\nIn the Veneto, when this was a traditional fall dish and it coincided with the seasonal butchering of pigs, this was be flavored with cotenna or pig skin. Today, you can often find pancetta or prosciutto, in thin strips, sizzled together with the soffritto. A piece of Parmesan rind is often thrown into the simmering sauce to add flavor. To keep this dish vegetarian or vegan, simply leave these out and use vegetable stock instead of water. Grated cheese on top of this pasta dish is entirely optional—my Tuscan mother-in-law never likes to mix cheese with beans. She says it masks the flavor too much.\nYou can also make this with dried beans (it's the best way, really, but for convenience's sake, the recipe here is for already cooked beans). If you’re using dried borlotti beans, put them in a bowl covered with plenty of fresh cold water the night before and leave them to soak in the fridge. The next day, drain and place them in a saucepan, cover with fresh water, add a bay leaf and simmer for a couple of hours or until the beans are tender. Add salt to taste at the end. Don’t throw away the cooking liquid – this is gold and you should use it in place of the stock or water. —Emiko",
      "ingredients": [
        {
          "ingredient": "3 tablespoons extra-virgin olive oil, plus more for drizzling"
        },
        {
          "ingredient": "1 small red onion, finely chopped"
        },
        {
          "ingredient": "1/2 celery stick, finely chopped"
        },
        {
          "ingredient": "1 small carrot, peeled and finely chopped"
        },
        {
          "ingredient": "2-3 slices of pancetta, cut into thin strips (optional)"
        },
        {
          "ingredient": "14 ounces (400 grams) cooked and drained borlotti beans (note that a regular size can normally holds 240 grams of beans)"
        },
        {
          "ingredient": "1/3 cup (80 ml) tomato puree (passata)"
        },
        {
          "ingredient": "1 cup (250 ml) water or vegetable or beef stock"
        },
        {
          "ingredient": "7 ounces (200 grams) short pasta such as ditalini"
        }
      ],
      "directions": [
        {
          "step": "In a casserole pot, gently saute the chopped onion, celery and carrot in the olive oil with a good pinch of salt. Let the vegetables soften without colouring, about 5-10 minutes. Add the pancetta, if using, and continue cooking, stirring occasionally, letting the pancetta sizzle until it is transparent."
        },
        {
          "step": "Add the drained beans, along with the tomato puree and the water (or stock or bean liquid if you have cooked them yourself). Bring to a simmer and cook 15 minutes."
        },
        {
          "step": "Put a pot of water on to boil for the pasta."
        },
        {
          "step": "Remove about half of the bean mixture and blend until creamy (alternatively, if you have an immersion blender, stick it straight in the pot and blend about half of the sauce). If it has reduced too much and is looking too thick (like a dip rather than a soup), add some more water until it is like a creamy soup. Season with salt and pepper and keep warm while you boil the pasta."
        },
        {
          "step": "Cook the pasta in a pot of boiling water. Check the timing recommended on the package and take off roughly 2 minutes. Drain the pasta and add it to the beans and let it continue cooking another minute. Ladle into shallow bowls, pour over a drizzle of your very best extra-virgin olive oil, some extra freshly ground pepper, and then let it sit for a moment or two before serving (it needs to cool a little to be best enjoyed). Serve this pasta dish with a spoon."
        }
      ]
    },
    {
      "name": "Freeze-Ahead Dinner Rolls",
      "author": "Posie (Harwood) Brien",
      "author_url": "https://food52.com/users/18740-posie-harwood-brien",
      "date": "October 31, 2016",
      "description": "A smart way to prep ahead, this recipe from Fleischmann's makes it easy to have frozen dinner rolls on hand so you're never far from warm, homemade bread. —Posie (Harwood) Brien",
      "ingredients": [
        {
          "ingredient": "5 1/2 to 6 1/2 cups all-purpose flour"
        },
        {
          "ingredient": "1/2 cup sugar"
        },
        {
          "ingredient": "1 1/2 teaspoons salt"
        },
        {
          "ingredient": "4 1/2 teaspoons instant or active dry yeast (2 envelopes)"
        },
        {
          "ingredient": "1 1/4 cups water"
        },
        {
          "ingredient": "1/2 cup milk"
        },
        {
          "ingredient": "1/3 cup butter"
        },
        {
          "ingredient": "2 eggs, at room temperature"
        }
      ],
      "directions": [
        {
          "step": "In the bowl of a stand mixer, whisk together 2 cups flour, sugar, salt, and yeast."
        },
        {
          "step": "In a small saucepan or microwave, heat the milk, water, and butter together until warm but not hot. It's okay if the butter doesn't melt entirely."
        },
        {
          "step": "Add the wet ingredients to the dry and mix well. Mix on medium speed with the dough hook for 2 minutes."
        },
        {
          "step": "Add 1/2 cup of flour and the eggs and beat for another 2 minutes. Add enough flour to make an elastic dough -- the dough will be sticky but shouldn't be wet. You may not use all the flour called for, or you might need a little more than the recipe calls for. Just add it a little at a time until the consistency is right."
        },
        {
          "step": "Knead the dough for 8-10 minutes."
        },
        {
          "step": "Transfer the dough to a lightly greased bowl, cover, and let rise for about 20 minutes."
        },
        {
          "step": "Punch down the dough and, using lightly floured hands, shape into whatever shape you want. My favorite shapes are these three. 1: Cloverleaf rolls: Pinch off small pieces, roll them into balls, and place three small balls each into the wells of well-greased muffin tin. 2: Classic rolls: Divide the dough into 18 pieces, roll each piece into a ball, and place 9 balls in one greased 9\" round pan and 9 in another 9\" round pan. 3: Twist rolls: Divide the dough into 18 equal pieces. Roll each piece out into a thin coil, twist the coil around your hands into a knot, and place on a lightly greased baking sheet."
        },
        {
          "step": "Once you've shaped your dough, place them into the freezer (for the muffin tin and round pan rolls, just put the entire pan into the freezer) and freeze until very firm. Transfer the frozen shaped rolls into a plastic bag (the round pan rolls should stay in one big round), and freeze for up to 4 weeks."
        },
        {
          "step": "When you're ready to bake, remove the rolls from the freezer. If you're baking cloverleaf rolls or the pan rolls, transfer them back into the same muffin tin or round baking pan that you shaped them in (grease it first). If baking freeform shapes like twist rolls, just place them on a greased baking sheet. Cover with plastic wrap or a damp towel and let rise until puffy, about 1 1/2 hours. Just before baking, sprinkle with flaky sea salt (if desired)."
        },
        {
          "step": "Preheat the oven to 350°F and bake for about 15 minutes, or until golden brown."
        },
        {
          "step": "Note: If you want to skip the freezing step, you can. Just preheat the oven after shaping your rolls, let them rise for 15 minutes, and then bake."
        }
      ]
    },
    {
      "name": "Cranberry Cookie Bars",
      "author": "simplycooking101",
      "author_url": "https://food52.com/users/10764-simplycooking101",
      "date": "October 30, 2016",
      "description": "WHO: simplycooking101 has been a member since 2010!\nWHAT: A crumble-topped cookie bar that uses leftover cranberry sauce.\nHOW: Make a buttery, nutty base (thanks to ground toasted pecans or walnuts) and use half for the crust and half to crumble over the cranberry sauce.\nWHY WE LOVE IT: If you’re like us, you often have a lot of leftover cranberry sauce—more than you know what to do with. These bars take care of that, using a whopping 3 cups of leftover sauce! Plus, with only 6 ingredients, they’re a snap to put together. —The Editors",
      "ingredients": [
        {
          "ingredient": "3 cups flour"
        },
        {
          "ingredient": "3 cups powdered Sugar"
        },
        {
          "ingredient": "3 cups ground toasted pecans or walnuts"
        },
        {
          "ingredient": "1 1/2 cups butter"
        },
        {
          "ingredient": "1 1/2 teaspoons cinnamon"
        },
        {
          "ingredient": "3 cups cranberry sauce"
        }
      ],
      "directions": [
        {
          "step": "Heat the oven to 375° F. In a 9 x 13 pan, fold a piece of foil about 20 inches long in half and place it across the long side of the bottom of the pan. This will serve as handles to help lift the bars out when they are baked. Spray with vegetable spray."
        },
        {
          "step": "In a large bowl stir all the ingredients except the cranberry sauce together, mixing well, but making sure that are some “lumps” and pieces to give it some texture."
        },
        {
          "step": "Pour all but 2 cups of the dough into the pan and flatten it out using the heel of your hand or a cup. Bake for 15-20 minutes until the crust is golden brown."
        },
        {
          "step": "Cover with the cranberry sauce. Crumble the remaining dough on top, keeping various sized chunks and leaving some open space. Bake for 20-25 minutes or until lightly browned."
        },
        {
          "step": "Cool then remove from the pan using the foil handles and cut into pieces. Sprinkle with a little powdered sugar and serve."
        }
      ]
    },
    {
      "name": "Pumpkin Swirl Brownies",
      "author": "Posie (Harwood) Brien",
      "author_url": "https://food52.com/users/18740-posie-harwood-brien",
      "date": "October 28, 2016",
      "description": "A very dense, fudgy brownie is topped with a quick pumpkin cheesecake-like batter and swirled together. The result is a serious brownie: one for chocolate lovers and not for the faint of heart! —Posie (Harwood) Brien",
      "ingredients": [
        {
          "ingredient": "For the brownie layer"
        },
        {
          "ingredient": "2 eggs"
        },
        {
          "ingredient": "3/4 cup cocoa powder"
        },
        {
          "ingredient": "1/2 teaspoon salt"
        },
        {
          "ingredient": "1/2 teaspoon baking powder"
        },
        {
          "ingredient": "1/2 teaspoon espresso powder (optional, for enhanced chocolate flavor)"
        },
        {
          "ingredient": "2 teaspoons vanilla extract"
        },
        {
          "ingredient": "1/2 cup unsalted butter (1 stick)"
        },
        {
          "ingredient": "1 cup sugar"
        },
        {
          "ingredient": "1 cup semisweet chocolate chunks or chips"
        },
        {
          "ingredient": "3/4 cup all-purpose flour"
        },
        {
          "ingredient": "For the pumpkin layer"
        },
        {
          "ingredient": "4 ounces cream cheese, softened"
        },
        {
          "ingredient": "1/2 cup pumpkin puree (sweet potato will work too)"
        },
        {
          "ingredient": "1 egg"
        },
        {
          "ingredient": "1 tablespoon sugar"
        },
        {
          "ingredient": "1/2 teaspoon ground ginger"
        },
        {
          "ingredient": "1/2 teaspoon ground cinnamon"
        },
        {
          "ingredient": "1/4 teaspoon ground nutmeg"
        }
      ],
      "directions": [
        {
          "step": "Preheat the oven to 350°F. Lightly grease an 8 inch square pan or line it with parchment paper or foil."
        },
        {
          "step": "To make the brownie layer: In a large bowl or stand mixer, add the eggs, cocoa powder, salt, baking powder, espresso powder, and vanilla. Beat for about 4 minutes."
        },
        {
          "step": "Melt the butter with the sugar in a saucepan over medium heat, or in the microwave. Whisk until the sugar dissolves and becomes shiny."
        },
        {
          "step": "Add the sugar/butter mixture to the cocoa mixture and mix well."
        },
        {
          "step": "Fold in the flour and semisweet chocolate and mix until evenly combined. Pour the batter into the prepared pan."
        },
        {
          "step": "To make the pumpkin layer: Mix all the ingredients together and whisk until thoroughly combined."
        },
        {
          "step": "Spoon the pumpkin mixture over the brownie layer. Using a knife, swirl the pumpkin into the chocolate. You can do this as little or as much as you want! If you don't swirl very much, the layers will be more distinct. If you swirl a lot, the batters will combine more for a denser brownie with less distinct layers. Both are delicious."
        },
        {
          "step": "Bake for 35-45 minutes (if you swirl them together more, it'll take on the longer side, but start checking after 35 minutes). The brownies should begin to pull away from the sides of the pan, the center should appear set, and a cake tester inserted in the center should have a few moist crumbs clinging to it."
        },
        {
          "step": "Let cool in the pan for at least 20 minutes, then slice."
        }
      ]
    },
    {
      "name": "Green Bean \"Casserole\"",
      "author": "Sara Jenkins",
      "author_url": "https://food52.com/users/225-sara-jenkins",
      "date": "October 26, 2016",
      "description": "Thanksgiving is often a meal of big rich heavy flavors—stuffing, gravy, meat, creamed onions, mashed root vegetables, with lashings butter and cream—but green beans inherently are light and clean and almost refreshing. I wanted to bridge the gap.\nI love to use crème fraîche in place of cream or sour cream because I like the very delicate sour tang with the rich full fat that rounds out of texture and flavor. I add toasted hazelnuts to mimic the fried onions of tradition, and they bring crunch as well as a pleasing buttery flavor contrast. Since green beans aren’t in season anyway, I suggest you use delicate and thin haricots verts instead of meaty green beans: They will be more delicate and tender, as well as a little sweeter, than overly large fall green beans (at least in New England, the original home of Thanksgiving!).\nI couldn’t decide if casserole had to be baked or could be called casserole just on the basis of the dish it's served in, but in the end decided that yes, it could just be the serving platter. And the green beans are delicious enough that no one will miss the canned fried onions! —Sara Jenkins",
      "ingredients": [
        {
          "ingredient": "3/4 cup crème fraîche"
        },
        {
          "ingredient": "1 tablespoon sherry vinegar"
        },
        {
          "ingredient": "1 tablespoon whole grain mustard"
        },
        {
          "ingredient": "2 tablespoons extra-virgin olive oil"
        },
        {
          "ingredient": "1/4 cup chopped chives"
        },
        {
          "ingredient": "1/2 cup raw hazelnuts"
        },
        {
          "ingredient": "2 pounds haricots verts, trimmed"
        }
      ],
      "directions": [
        {
          "step": "Whisk the crème fraîche, vinegar, mustard, and olive oil together. Fold in the chives and set aside to reserve at room temperature."
        },
        {
          "step": "Toast the hazelnuts in a pan on the stove over low heat about 4 to 5 minutes until just beginning to get golden in color and to smell nutty. Remove from the heat, roughly chop, and set aside."
        },
        {
          "step": "Bring a pot of salted water to a boil and blanch the green beans until just bright green and crisp. Drain, then toss immediately with the crème fraîche mixture. Season with salt and pepper, then garnish with the toasted hazelnuts"
        }
      ]
    },
    {
      "name": "Bengali Cholar Dal",
      "author": "Meera Sodha",
      "author_url": "https://food52.com/users/822600-meera-sodha",
      "date": "October 26, 2016",
      "description": "This recipe uses chana dal, the split insides of the black chickpea. They’re naturally very flavorful and don’t need a lot of spicing to transform into a gorgeous, mild coconut dal. In Bengal, this is usually eaten with puri, which are little puffed fried breads, but I like to serve mine with a vegetable subji (dry curry), some punchy pickle, and rice or hot naan bread. —Meera Sodha",
      "ingredients": [
        {
          "ingredient": "1 3/4 cups chana dal"
        },
        {
          "ingredient": "2 tablespoons mustard or canola oil"
        },
        {
          "ingredient": "3 cloves garlic, crushed"
        },
        {
          "ingredient": "1 1/2 inches ginger, grated"
        },
        {
          "ingredient": "3 medium, ripe tomatoes, chopped"
        },
        {
          "ingredient": "1 1/4 teaspoons nice red chili powder"
        },
        {
          "ingredient": "1/2 teaspoon turmeric"
        },
        {
          "ingredient": "1 1/2 teaspoons ground cinnamon"
        },
        {
          "ingredient": "1/3 teaspoon ground cloves"
        },
        {
          "ingredient": "1/2 teaspoon ground cardamom"
        },
        {
          "ingredient": "1 1/4 teaspoons salt"
        },
        {
          "ingredient": "1 teaspoon sugar"
        },
        {
          "ingredient": "1 14-ounce can coconut milk"
        },
        {
          "ingredient": "1 handful Toasted shredded coconut, to serve"
        }
      ],
      "directions": [
        {
          "step": "Wash the chana dal in a few changes of cold water until the water runs clear, then cover with twice the amount of water and boil for around 45 minutes, or until cooked through and tender then leave to one side."
        },
        {
          "step": "Heat the oil in a large frying pan over a medium heat and, when hot, add the garlic and ginger. Stir-fry until the garlic starts to brown, then add the tomatoes and cook the tomatoes for around 5 to 8 minutes, or until they reduce and become quite paste-like."
        },
        {
          "step": "Add the turmeric, cinnamon, cloves, cardamom, salt, and sugar to the tomatoes. Stir-fry for a couple of minutes, then add the tomato mixture and the coconut milk into the chana dal and stir to mix."
        },
        {
          "step": "Bring the dal to the boil, then turn the heat down and simmer for 5 to 7 minutes to bring all the flavors together. Taste your dal, adjusting salt as need be and topping up with hot water until it’s the perfect consistency for rice. Scatter with the toasted coconut and serve with hot steamed basmati rice."
        }
      ]
    },
    {
      "name": "Dal Makhani",
      "author": "Meera Sodha",
      "author_url": "https://food52.com/users/822600-meera-sodha",
      "date": "October 26, 2016",
      "description": "This is a recipe for one of the world’s finest dishes, which comes from Punjab. It takes exactly 142 minutes and 47 stirs to make, and it is worth every single one. Give it time and it will reward you handsomely with the most captivating, indulgent dal you’ve ever eaten, full of earthy, smoky flavors, rich deep tomato, and warm buttery notes.\nYou’ll need to soak the urad beans the night or morning before you want to eat it (6 hours is fine), and put it on the stove on a low heat a couple of hours before eating. Ask anyone passing by to give it a stir. This dal can also be made a day in advance.\nThis recipe is from my book Made in India (Flatiron 2015). —Meera Sodha",
      "ingredients": [
        {
          "ingredient": "14 ounces urad dal"
        },
        {
          "ingredient": "4 tablespoons unsalted butter, plus 2 tablespoons to finish"
        },
        {
          "ingredient": "2 large onions, finely sliced"
        },
        {
          "ingredient": "1 3/4-inch piece ginger, peeled and grated"
        },
        {
          "ingredient": "10 cloves garlic, crushed"
        },
        {
          "ingredient": "6 tablespoons tomato paste"
        },
        {
          "ingredient": "1 3/4 teaspoons salt"
        },
        {
          "ingredient": "3/4 teaspoon nice red chili powder (or to taste)"
        },
        {
          "ingredient": "1 1/2 cups whole milk"
        }
      ],
      "directions": [
        {
          "step": "In a sieve, rinse the urad dal in a couple of changes of cold water, until the water runs clear, then drain and put into a deep pan—they will double in volume while soaking. Cover with a generous amount of just-boiled water and leave them to soak for at least 6 and up to 24 hours."
        },
        {
          "step": "Once they’ve finished soaking, rinse, drain, and put back into the pan. Cover them with cold water and bring to the boil, then continue boiling for 45 minutes. Scrape off any scum that forms on the top and discard."
        },
        {
          "step": "Meanwhile, put 4 tablespoons of butter into a frying pan on a medium heat. When it starts to foam, add the onions and cook for 15 minutes, then add the ginger and garlic. Fry for another 5 minutes. It’s not worth skimping on the time here: The longer you cook these (without burning), the more flavorful your dal will be. Add the tomato paste, salt, and chili powder, stir well, then take off the heat and set aside."
        },
        {
          "step": "Once boiled, the dal should be soft enough to crush against the side of the pan. When it is done, keep enough water in the pan to just cover them and drain the rest off. Add the onion and tomato mixture and the milk, bring to the boil, then turn the heat down to a simmer."
        },
        {
          "step": "Stir every now and then for around 1 1⁄2 hours. If the sauce starts to run low over time, top it up with an equal mixture of whole milk and water. The sauce will start to turn darker, richer and creamier. If the dal is not rich and dark after 1 1⁄2 hours, give it some more time: You can’t do this dish any harm by cooking it for a little longer."
        },
        {
          "step": "Taste, adjust the salt and chili if necessary, and add the remaining butter just before serving and stir. Serve alongside rice or hot fluffy naan."
        }
      ]
    },
    {
      "name": "Almond Apple Pie",
      "author": "Posie (Harwood) Brien",
      "author_url": "https://food52.com/users/18740-posie-harwood-brien",
      "date": "October 22, 2016",
      "description": "A thin layer of almond paste between the crust and the filling of this apple pie recipe, which comes from the Odense almond paste can, serves a dual purpose: Adding a nutty, sugary almond flavor much like an almond croissant, and helping keep the bottom crust from getting soggy. —Posie (Harwood) Brien",
      "ingredients": [
        {
          "ingredient": "1 recipe for double pie crust (this is a good one! https://food52.com/recipes...)"
        },
        {
          "ingredient": "3 pounds apples, peeled, cored, and thinly sliced (about 6 cups)"
        },
        {
          "ingredient": "1 tablespoon lemon juice"
        },
        {
          "ingredient": "3/4 cup sugar"
        },
        {
          "ingredient": "1/4 cup all-purpose flour"
        },
        {
          "ingredient": "2 teaspoons ground cinnamon (I use Vietnamese cinnamon)"
        },
        {
          "ingredient": "1 teaspoon ground nutmeg"
        },
        {
          "ingredient": "1/2 teaspoon kosher salt"
        },
        {
          "ingredient": "7 ounces almond paste"
        },
        {
          "ingredient": "3 tablespoons butter, melted"
        },
        {
          "ingredient": "milk + sugar, for the crust"
        }
      ],
      "directions": [
        {
          "step": "Preheat the oven to 425°F."
        },
        {
          "step": "In a large bowl, combine the sliced apples with the lemon juice. Whisk together the sugar, flour, cinnamon, nutmeg, and salt in a separate bowl, then toss with the apples and lemon juice."
        },
        {
          "step": "Roll out your bottom crust and transfer it to a 9\" pie plate. Press it up the sides."
        },
        {
          "step": "Take your almond paste, and roll it out into a thin circle, about 9\" in diameter. It shouldn't be any thicker than about 1/8\" -- if it is, set some aside for another use. Transfer the thin disc of almond paste to the pie plate and press it gently on top of your bottom crust."
        },
        {
          "step": "Fill your pie crust with the sliced apple mixture. Dot the top of the apples with the melted butter. Place in the refrigerator while you roll out the top crust."
        },
        {
          "step": "Roll out the top crust. Transfer it to the top of your pie plate and crimp the edges. Cut 5 slits in the top of the crust in the center to let steam escape. Brush the crust with milk and sprinkle with sugar (optional)."
        },
        {
          "step": "Bake the pie for 15 minutes, then reduce the oven heat to 375°F and bake for 35-40 minutes more, until the fruit is soft and bubbling and the crust is golden. If the crust is browning too quickly, you can cover it with foil."
        },
        {
          "step": "Remove from the oven and let the pie cool for at least 20 minutes before serving."
        }
      ]
    },
    {
      "name": "Cranberry, Onion, and Ginger Chutney",
      "author": "Sara Jenkins",
      "author_url": "https://food52.com/users/225-sara-jenkins",
      "date": "October 21, 2016",
      "description": "The cranberry and orange are familiar and classic, but the candied ginger adds heat and excitement, the sweet raisins balance the tang of the fruit and the cider vinegar, and the mustard seeds create little textural explosions. I toast them, along with dried turmeric and fresh and ground chile, as I sauté the onions (a lot of onions) and before I add in the cranberries and the ginger, so that their flavors can permeate the sauce as it cooks.\nMost often, I serve this chutney in the winter months as a complement to cheese—the stronger the better (try a gorgonzola picante or a sharp aged sheep’s milk cheese). But it's a great complement to that pride of Thanksgiving, a beautiful, properly roasted turkey. —Sara Jenkins",
      "ingredients": [
        {
          "ingredient": "2 tablespoons vegetable oil"
        },
        {
          "ingredient": "1 tablespoon mustard seeds"
        },
        {
          "ingredient": "3 cups diced onions"
        },
        {
          "ingredient": "1 teaspoon ground cayenne"
        },
        {
          "ingredient": "1 fresh cayenne chile"
        },
        {
          "ingredient": "1/2 teaspoon ground turmeric"
        },
        {
          "ingredient": "2 quarts cranberries"
        },
        {
          "ingredient": "1 cup candied ginger, finely chopped"
        },
        {
          "ingredient": "1 tablespoon salt"
        },
        {
          "ingredient": "1 cup seedless raisins"
        },
        {
          "ingredient": "2 cups apple cider vinegar"
        },
        {
          "ingredient": "1 orange, zested and juiced"
        },
        {
          "ingredient": "1 pound dark brown sugar (2 1/2 cups)"
        }
      ],
      "directions": [
        {
          "step": "In a large sauce pan, heat the vegetable oil. Sauté the onions, mustard seeds, ground cayenne, fresh cayenne, and turmeric, and cook, stirring often, until translucent."
        },
        {
          "step": "Add cranberries and candied ginger. Sauté about ten minutes. Add salt, raisins, vinegar, orange zest and juice, and brown sugar and cook on low heat for about an hour and a half, stirring from time to time, until thick and sauce-like in consistency."
        }
      ]
    },
    {
      "name": "Hot Water Crust",
      "author": "Erin McDowell",
      "author_url": "https://food52.com/users/3572-erin-mcdowell",
      "date": "October 21, 2016",
      "description": "There's a reasons the Brits swear by this crust: it's crisp as can be, but still has a lot of flavor. But it's biggest pro is it's sturdiness. This crust does for pies what gingerbread does for holiday houses—it stays put, and holds up incredibly well. That means you can go deep dish without fear, and fill it chock full with any kind of filling without worry! You have to work with the crust while it's still warm, so be sure you have your filling ready to go before you start the crust. —Erin McDowell",
      "ingredients": [
        {
          "ingredient": "2 1/2 cups (10.62 oz) all purpose flour"
        },
        {
          "ingredient": "1/2 cup (2.12 oz) bread flour"
        },
        {
          "ingredient": "3/4 teaspoon (3 g) salt"
        },
        {
          "ingredient": "1/3 cup (2.66 fl oz) water"
        },
        {
          "ingredient": "1/2 cup (4.00 oz) unsalted butter"
        },
        {
          "ingredient": "1/2 cup (4.00 oz) lard (or shortening, if you must)"
        }
      ],
      "directions": [
        {
          "step": "Have your filling ready to go. In a large bowl, whisk the all purpose flour, the bread flour, and the salt to combine."
        },
        {
          "step": "In a medium pot, bring the water to a boil over medium heat. Add the butter and lard and stir until melted. The mixture should be hot—if needed, bring it back to a simmer briefly."
        },
        {
          "step": "Make a well in the center of the flour mixture, and pour the hot liquid into it. I usually start mixing it with a fork—but a silicone spatula or wooden spoon works too. Mix until the mixture forms a shaggy mass: It should form a ball but not look smooth."
        },
        {
          "step": "Remove the dough from the bowl and knead it on a clean, smooth surface until it’s smooth, 2-3 minutes."
        },
        {
          "step": "You have to work with the dough while it’s still warm—divide the dough as needed for your recipe. You can roll the dough out (between two sheets of parchment paper is best and helps prevent sticking, ripping, and tearing). You can also press the dough into a pan. For deep dish pies, I tend to opt for a combination—rolling the dough out, then patching the holes as needed—just be sure to patch well! You want smooth sides and no chance for leakage."
        }
      ]
    },
    {
      "name": "PanWaffle",
      "author": "Erin McDowell",
      "author_url": "https://food52.com/users/3572-erin-mcdowell",
      "date": "October 20, 2016",
      "description": "I'm a big fan of The Tonight Show and was delighted by a diagram Jimmy Fallon drew a few weeks back describing his ideal \"meta breakfast\" invention. It was a waffle surrounded by a pancake. Since then, I've made more than a few batches, and I can attest Mr. Fallon is on to something. One batter. Two textures. The best breakfast mashup since breakfast burritos. —Erin McDowell",
      "ingredients": [
        {
          "ingredient": "4 cups all purpose flour"
        },
        {
          "ingredient": "1/4 cup sugar"
        },
        {
          "ingredient": "2 teaspoons baking powder"
        },
        {
          "ingredient": "1 1/2 teaspoons baking soda"
        },
        {
          "ingredient": "1 1/2 teaspoons salt"
        },
        {
          "ingredient": "3 large eggs"
        },
        {
          "ingredient": "3 cups buttermilk"
        },
        {
          "ingredient": "2 teaspoons vanilla extract"
        },
        {
          "ingredient": "1/2 cup butter, melted and cooled slightly."
        },
        {
          "ingredient": "nonsticky spray of choice, as needed"
        }
      ],
      "directions": [
        {
          "step": "Preheat your waffle iron. You'll want to use a shallow-ish waffle iron that makes relatively flat waffles. Belgian waffles are delicious, but they won't fly here."
        },
        {
          "step": "Also prepare your pan for cooking the panwaffle in. I like to use a flat griddle, because it makes it much easier to flip. But any large pan will do. Get it nice and hot, then turn the heat down to low while you get things going."
        },
        {
          "step": "In a large bowl, whisk the flour, sugar, baking powder, baking soda, and salt together to combine. In a large bowl or measuring cup (preferably something with a spout), whisk the eggs, buttermilk, vanilla, and melted butter to combine."
        },
        {
          "step": "Pour the wet ingredients into the dry ingredients and whisk until relatively smooth. It's ok if it's a bit lumpy!"
        },
        {
          "step": "Make the waffles: when your waffle iron is nice and hot, give it a generous coating of nonstick spray. Ladle about 2/3 cup batter into the center of the iron, then close it. Cook the waffle until it is set, but not yet golden. You want to under-cook the waffle a bit since it will brown more on the stovetop. If you like your waffles super crispy, cook it until it just begins to turn golden (2-3 minutes). Repeat until you have 6 waffles."
        },
        {
          "step": "Make one panwaffle at a time (you can make two on a large griddle, but it's easier to just do one at once - they're BIG). Spray the hot cooktop with nonstick spray and raise the heat to medium. Place a waffle onto the griddle, then ladle about 2/3 cup of batter evenly around it. The mixture will bubble, as pancakes like to do. When the bubbles stop appearing on the surface of the batter, it's time to flip (2-3 minutes)."
        },
        {
          "step": "Just like with traditional pancakes, flipping is all about confidence. It also helps to use the biggest spatula you have. You can even use two if it's easier for you. Run the spatula around the edge to make sure everything is cooked and golden, then flip away! Cook another 2-3 minutes on the other side."
        },
        {
          "step": "Serve warm with butter and maple syrup!"
        }
      ]
    },
    {
      "name": "Sarah Polk’s Hickory Nut Cake",
      "author": "Anne Byrn",
      "author_url": "https://food52.com/users/1039378-anne-byrn",
      "date": "October 17, 2016",
      "description": "When hickory trees populated America, people would rush to gather the sweet, buttery nuts in the fall before the animals did. Carol Meeks of Indianapolis, said that in 1838 her great-great-grandparents purchased Indiana farmland with an abundance of shagbark hickory trees. Gathering the nuts became a generations-old tradition, and the nuts were laid under beds in the old farmhouse to dry, before cracking, shelling, and folding the nut meat into cakes and cookies for the holidays. Smooth, ivory-colored hickory nuts are one of the few indigenous American nuts, and Native Americans ate them raw. They are a lot like the pecan, only smaller, harder to obtain, and more labor intensive to shell. Hickory wood is known for its strength and durability, used for tool handles and fence posts in addition to firewood.\nThis pound cake with chopped hickory nuts folded into the batter was popular during the 1800s and is adapted from The First Ladies Cook Book by Margaret Brown Klapthor. It was a favorite recipe of Sarah Polk, wife of former U.S. president James K. Polk. —Anne Byrn",
      "ingredients": [
        {
          "ingredient": "Butter and flour for prepping the pan"
        },
        {
          "ingredient": "1 cup (2 sticks) unsalted butter, at room temperature"
        },
        {
          "ingredient": "2 cups granulated sugar"
        },
        {
          "ingredient": "4 large eggs, separated"
        },
        {
          "ingredient": "3 cups all-purpose flour"
        },
        {
          "ingredient": "2 teaspoons baking powder"
        },
        {
          "ingredient": "1/2 teaspoon salt"
        },
        {
          "ingredient": "1 teaspoon fresh lemon juice"
        },
        {
          "ingredient": "1 cup whole milk or half-and-half"
        },
        {
          "ingredient": "1 cup chopped hickory nuts or pecans"
        },
        {
          "ingredient": "1/2 teaspoon pure almond extract (optional)"
        },
        {
          "ingredient": "1/2 teaspoon vanilla extract (optional)"
        }
      ],
      "directions": [
        {
          "step": "Place a rack in the center of the oven, and preheat the oven to 350° F. Lightly butter and flour a 10-inch tube pan, and shake out the excess flour. Set the pan aside."
        },
        {
          "step": "Place the butter in a large mixing bowl, and beat with an electric mixer on medium speed until creamy, 1 minute. Add the sugar, a couple of tablespoons at a time, beating on medium until light and creamy, 2 minutes. Add the egg yolks, one at a time, beating until combined. Set aside."
        },
        {
          "step": "Place the flour, baking powder, and salt in a large mixing bowl and sift to combine. Set aside. Place the egg whites in a large mixing bowl and, with clean beaters, beat on high speed until stiff peaks form, about 4 minutes. Set aside. Stir the lemon juice into the milk. Alternately add the flour mixture and milk to the butter mixture in 3 additions, beating on low speed just to combine. Beat in the hickory nuts and extracts, if desired, on low speed until combined. By hand, fold the beaten egg whites into the batter, just until combined. Turn the batter into the prepared pan, smooth the top, and place the pan in the oven."
        },
        {
          "step": "Bake the cake until it is golden brown and begins to pull away from the sides of the pan, 55 to 60 minutes. Remove the cake from the oven, and place the pan on a wire rack to cool for 20 minutes. Run a knife around the edges of the pan, give the pan a gentle shake, then invert the cake onto the rack to cool, right side up, for 30 minutes. Slice and serve."
        }
      ]
    },
    {
      "name": "Orange Vegetable Pileup with Homemade Cottage Cheese",
      "author": "Sarah Jampel",
      "author_url": "https://food52.com/users/124167-sarah-jampel",
      "date": "October 15, 2016",
      "description": "The cottage cheese recipe is from Food52er lapadia and only takes 35 minutes to make, from start to finish! While the cottage cheese rests, start the rest of the dinner, inspired by Winter Squash Agrodolce in Bon Appétit. —Sarah Jampel",
      "ingredients": [
        {
          "ingredient": "For the cottage cheese (makes about 3/4 cup):"
        },
        {
          "ingredient": "4 cups whole milk"
        },
        {
          "ingredient": "2 tablespoons lemon juice"
        },
        {
          "ingredient": "1 splash Cream, milk, yogurt, or crème fraîche"
        },
        {
          "ingredient": "1 dash Salt and pepper, to taste"
        },
        {
          "ingredient": "For the orange vegetable pileup:"
        },
        {
          "ingredient": "3 pounds (more or less) winter squash and/or sweet potatoes (I like a mix of delicata, kabocha, and Japanese yam)"
        },
        {
          "ingredient": "3 tablespoons olive oil"
        },
        {
          "ingredient": "2 hot red chiles (like bird's eye or cayenne), thinly sliced"
        },
        {
          "ingredient": "3/4 cup red wine vinegar"
        },
        {
          "ingredient": "1/4 cup honey"
        },
        {
          "ingredient": "2 tablespoons golden raisins, chopped"
        },
        {
          "ingredient": "1 teaspoon red pepper flakes"
        },
        {
          "ingredient": "Salt"
        },
        {
          "ingredient": "2 tablespoons chopped parsley"
        },
        {
          "ingredient": "2 tablespoons chopped cilantro"
        },
        {
          "ingredient": "1 lime"
        },
        {
          "ingredient": "1 Coarsely chopped roasted salted almonds, for garnish (optional)"
        }
      ],
      "directions": [
        {
          "step": "Affix a candy thermometer to a large pot and pour in the milk. Over medium heat, heat the milk until it reaches between 175° to 180° F, stirring now and then to keep the milk from sticking."
        },
        {
          "step": "Take the pot off the heat, add the lemon juice while stirring, and mix thoroughly. Cover the pot with a dish towel and let sit for 30 minutes, until you see that the curds have separated. (You can start prepping the orange vegetables—see below—as you wait!)"
        },
        {
          "step": "Set a colander lined with cheesecloth in a bowl, then slowly pour the curds and whey into the colander and allowing the whey to drain away. Wait about 5 minutes. (Discard the whey or save it for several other uses: https://food52.com/blog/14715-12-ways-to-use-up-whey.)"
        },
        {
          "step": "Tie the four corners of the cheesecloth around the curds, then rinse under cold water until cool enough to handle, then squeeze and rinse. After completely cooled and squeezed, transfer to a bowl and sprinkle with salt."
        },
        {
          "step": "When ready to serve, stir in cream, milk, yogurt, or crème fraîche to make a creamy mixture. Add salt and pepper to taste."
        },
        {
          "step": "Heat the oven to 475° F. Peel any squashes that need peeling (peel kabocha, buttercup, red kuri; no need to peel delicata or sweet potatoes). Remove seeds from any squashes, then cut all vegetables into wedges about 3/4-inch thick. (You'll need to cut any very long squash in half lengthwise before wedging)."
        },
        {
          "step": "Toss the wedges with 3 tablespoons of olive oil, a generous shower of salt, and grindings of black pepper. Spread the wedges out on a baking sheet and cook for about 20 to 25 minutes, flipping halfway through, until soft all the way through and golden-brown and caramelized."
        },
        {
          "step": "Meanwhile, in a small saucepan over medium heat, bring chiles, vinegar, honey, raisins, red pepper flakes, and a pinch of salt to a boil. Reduce heat and simmer until thicker and more syrupy, 8 to 10 minutes."
        },
        {
          "step": "Take the finished vegetables out of the oven, brush with the warm agrodolce, and transfer to a serving plate. Dollop the cottage cheese (stirred with the cream to make it creamier) all over, sprinkle with herbs, then spoon the rest of the agrodolce over top, drizzling it over all the vegetables. Shower with lime zest and a squeeze of lime juice. Top with chopped nuts if desired."
        }
      ]
    },
    {
      "name": "The New Classic Peanut Butter Cookies",
      "author": "Posie (Harwood) Brien",
      "author_url": "https://food52.com/users/18740-posie-harwood-brien",
      "date": "October 13, 2016",
      "description": "If you combine a lot of excellent things (peanut butter, cookie dough, brown butter, and roasted salted nuts), it stands to reason that the end result will be impressively delicious. This cookie recipe, adapted loosely from the recipe from the back of the Jif jar for classic PB cookies, proves the point. —Posie (Harwood) Brien",
      "ingredients": [
        {
          "ingredient": "1/2 cup roasted, salted peanuts"
        },
        {
          "ingredient": "1/2 cup unsalted butter"
        },
        {
          "ingredient": "1 cup brown sugar"
        },
        {
          "ingredient": "1/2 teaspoon vanilla extract"
        },
        {
          "ingredient": "1 egg"
        },
        {
          "ingredient": "1 1/4 cups all-purpose flour"
        },
        {
          "ingredient": "1/2 teaspoon salt"
        },
        {
          "ingredient": "1/2 teaspoon baking powder"
        },
        {
          "ingredient": "1/4 teaspoon baking soda"
        },
        {
          "ingredient": "1 cup creamy peanut butter"
        }
      ],
      "directions": [
        {
          "step": "Preheat oven to 350°F."
        },
        {
          "step": "While the oven preheats, toast the peanuts on a baking sheet until just beginning to brown (about 10 minutes). Let the nuts cool, then roughly chop them."
        },
        {
          "step": "Melt the butter in a saucepan over medium heat, swirling the pan constantly, until it begins to brown and smell nutty. Allow the butter to cool before proceeding with the recipe."
        },
        {
          "step": "Once the brown butter is cool (or not hot at least if you are impatient!), beat the butter, brown sugar, and vanilla together. Add the egg and beat well."
        },
        {
          "step": "Whisk together the flour, baking powder, baking soda, and salt. Add to the dry ingredients and mix well."
        },
        {
          "step": "Add the peanut butter and beat until combined. Stir in the chopped, toasted nuts."
        },
        {
          "step": "Drop the batter in heaping spoonfuls on a parchment-lined baking sheet. Using the back of a fork, press gently down in a cross-hatch pattern on top of each cookie and flatten the cookie to about 1/2\" thick. If you want, sprinkle with flaky sea salt and raw sugar. Bake until golden, between 8-12 minutes depending on the size of your cookie (don't overbake!)."
        }
      ]
    },
    {
      "name": "Steak with Braised Endive and Horseradish Cream",
      "author": "Sara Jenkins",
      "author_url": "https://food52.com/users/225-sara-jenkins",
      "date": "October 12, 2016",
      "description": "Growing up in Italy, steak was inevitably served grilled with olive oil and lemon as an easy preparation perfect for summertime outdoor dining.\nBut as summer recedes and we head indoors, I like a richer, more substantial preparation of my steak, and so I start turning my mind towards the French way with food, where things are built up more and more likely to be sauced. In this recipe, pepper-crusted steak is seared, sliced, and served over braised endives and alongside a horseradish crème fraîche. Sounds complicated, but once the endive is cooked and the steak is seared off and rested, it’s a quick dish to put together, suitable for a fancy dinner or just a very comforting Sunday night meal, and it tastes and looks fancier than it actually is. —Sara Jenkins",
      "ingredients": [
        {
          "ingredient": "2 great steaks (I recommend rib eye cut at least 1-inch thick, but this will work with just about any steak you fancy)"
        },
        {
          "ingredient": "2 tablespoons freshly ground black pepper"
        },
        {
          "ingredient": "4 tablespoons butter"
        },
        {
          "ingredient": "4 endive"
        },
        {
          "ingredient": "Juice of 1 orange"
        },
        {
          "ingredient": "1/4 to 1/2 cups chicken broth or water"
        },
        {
          "ingredient": "Juice and zest of 1 lemon"
        },
        {
          "ingredient": "1/2 cup crème fraîche"
        },
        {
          "ingredient": "one 2-inch piece fresh horseradish"
        },
        {
          "ingredient": "2 tablespoons extra-virgin olive oil"
        },
        {
          "ingredient": "Salt to taste"
        }
      ],
      "directions": [
        {
          "step": "Ideally, I like to rub the steaks with the pepper and let rest overnight, then bring back to room temperature before searing. If you forget or run out of time, rub them with the pepper and let them rest at room temperature for 30 minutes."
        },
        {
          "step": "About half an hour before you are ready to cook the steaks, prepare the endive. Preheat the oven to 375° F and get a heavy-bottomed sauté pan heating on the stove"
        },
        {
          "step": "Slice the endive in half lengthwise, trimming away any bruised or wilting leaves. Melt the butter in the sauté pan and when completely melted and beginning to foam, add the endive cut side down (if they don’t all fit in the pan, do this in batches). Season with salt and let the endive get good and golden on the cut side, about 5 minutes. Transfer the endive to a shallow roasting pan in a single layer, cut side up."
        },
        {
          "step": "Meanwhile, add the orange juice and chicken stock to the sauté pan and bring to a boil. Pour over the endive in the roasting pan and cover with tinfoil. Bake in the oven until tender, 30 to 45 minutes."
        },
        {
          "step": "Make the horseradish dressing: Whisk the lemon zest and juice into the crème fraîche. Add a tablespoon of Microplaned horseradish and a pinch of salt. Taste and adjust. I really like the flavor of the horseradish to dominate, so add some more if it's too mild."
        },
        {
          "step": "When the endive are close to done, get a cast-iron pan large enough to comfortably fit both steaks heating on the stove. Let it get really really hot. Pour the two tablespoons of olive oil in the pan and then add the steaks. Let them sear hard on one side about 5 to 7 minutes. When you have a nice brown crust, flip them over and season liberally with salt. Sear for another 4 to 6 minutes, long enough to form a brown crust on the other side. Turn the heat down and cook a little longer to the desired internal temperature. I like my steak at medium-rare, so it’s just a few more minutes depending on the thickness of the steak."
        },
        {
          "step": "Remove the steaks and place to rest on a grooved wooden chopping board. Meanwhile, remove the endive from the oven and pour the braising liquid into the steak pan. Place the endive on a serving platter. Reduce the endive cooking juices in the pan until reduced by half and becoming thick and syrupy, about 5 minutes. Slice the steak in 1-inch wide pieces (if you slice the steak at an angle it will look prettier as you will show the contrast between pink inside and crusty brown outside) and arrange on the platter with the endive. Pour the cooking sauces over it all and garnish with a dollop of the crème fraîche horseradish sauce, passing more at the table."
        }
      ]
    },
    {
      "name": "Joy the Baker's Olive Oil-Braised Chickpeas (More or Less)",
      "author": "Sarah Jampel",
      "author_url": "https://food52.com/users/124167-sarah-jampel",
      "date": "October 12, 2016",
      "description": "Chickpeas take a warm bath in seasoned olive oil and we'd like to join them. —Sarah Jampel",
      "ingredients": [
        {
          "ingredient": "3/4 cup high-quality olive oil"
        },
        {
          "ingredient": "1/4 cup finely diced yellow onion (red is good, too!)"
        },
        {
          "ingredient": "two 15-ounce cans chickpeas, drained and rinsed"
        },
        {
          "ingredient": "1/4 cup capers, drained"
        },
        {
          "ingredient": "Big pinches sea salt and freshly cracked black pepper"
        },
        {
          "ingredient": "3 sprigs fresh thyme (rosemary is good, too! same with sage)"
        },
        {
          "ingredient": "1 teaspoon chile flakes"
        },
        {
          "ingredient": "1/4 cup cured black olives, pitted and sliced in half"
        },
        {
          "ingredient": "1/2 lemon, sliced into thin wheels"
        },
        {
          "ingredient": "1/2 cup crumbled feta (ricotta cheese is also highly recommended)"
        },
        {
          "ingredient": "Smoky paprika, for serving"
        },
        {
          "ingredient": "Crusty bread, for serving"
        }
      ],
      "directions": [
        {
          "step": "Heat the oven to 375° F."
        },
        {
          "step": "In a small skillet over medium heat, add a splash of the olive oil. When it's hot, add the onions and sauté until softening and beginning to brown, about 5 minutes. Remove from the heat and scrape into a baking dish: Use an 8 x 8 or 9 x 9 if you want softer chickpeas and a 9 x 13 if you'd prefer some get a tad bit crispy on the bottom."
        },
        {
          "step": "Add the remaining olive oil, chickpeas, capers, salt, pepper, thyme, chile flakes, olives, and lemon slices to the dish, then stir to combine. Cover tightly with foil and bake 35 to 45 minutes, until the mixture is bubbling and the chickpeas are soft."
        },
        {
          "step": "Remove the foil, add the crumbled feta and paprika, and allow to cool for 15 minutes before serving with (or on top of) bread."
        }
      ]
    },
    {
      "name": "Crispy Quinoa and Mustard Green Cakes",
      "author": "Alexandra Stafford",
      "author_url": "https://food52.com/users/16479-alexandra-stafford",
      "date": "October 10, 2016",
      "description": "Inspired by Heidi Swanson’s baked quinoa cakes, these pack in a 1/2 pound of raw mustard greens.\nAny quinoa will do here, though I find the red visually appealing. Kale, broccoli rabe, or chard could be substituted for the mustard greens. The original recipe calls for feta, which would be really nice, too, as would many cheeses.\nIf you wish to bake these, which will yield a slightly dryer, eggier-tasting patty (almost frittata-like), preheat the oven to 400ºF. Line a baking sheet with parchment paper, a Silpat, or grease it lightly with oil. Place as many ball as you wish to bake on the prepared pan. Flatten gently with your hand to form a patty. Season with salt and pepper to taste. Bake for 18 to 20 minutes, until lightly golden and cooked through.\nThe mixture can be prepared ahead of time and stored in the fridge for days. It's best not to form the patties ahead of time, however, because the juices from the greens begin to seep out.\nI like to serve these with a slightly sweet, tahini-yogurt sauce. You could also simply stir together greek yogurt and sriracha and season to taste with salt. —Alexandra Stafford",
      "ingredients": [
        {
          "ingredient": "3/4 cup dried quinoa"
        },
        {
          "ingredient": "kosher salt"
        },
        {
          "ingredient": "1/2 pound mustard greens, rough ends trimmed and discarded"
        },
        {
          "ingredient": "2 teaspoons cumin seed or ground cumin"
        },
        {
          "ingredient": "1 cup diced red onion"
        },
        {
          "ingredient": "freshly cracked pepper to taste"
        },
        {
          "ingredient": "1 cup fresh bread crumbs"
        },
        {
          "ingredient": "1/2 cup grated Parmigiano Reggiano, see notes above"
        },
        {
          "ingredient": "4 eggs"
        },
        {
          "ingredient": "grapeseed or other neutral oil, for frying"
        },
        {
          "ingredient": "lemons, cilantro, naan, tahini-yogurt sauce for serving, optional, see notes above"
        }
      ],
      "directions": [
        {
          "step": "Fill a large pot with water and place over high heat. Bring to a boil. Add the quinoa and 1 tablespoon kosher salt and simmer for 9 minutes, just until the quinoa begins to unfurl. Drain through a fine-meshed strainer."
        },
        {
          "step": "Meanwhile, pulse the greens in a food processor. It’s best to do this in two batches: fill the processor with greens. Pulse until the greens fall to the bottom. The pieces should be small but not puréed or mushy. Transfer them to a large bowl. Repeat with the remaining greens."
        },
        {
          "step": "In a small skillet over medium heat, toast the cumin seeds or powder until fragrant and slightly darker in color. If using seeds, crush them gently with a mortar and pestle or in a spice grinder. Transfer to the bowl with the greens. Add the drained quinoa, onion, 1 teaspoon of salt, pepper to taste, bread crumbs, cheese and eggs. Mix with your hands or a spatula until everything is well blended."
        },
        {
          "step": "Test the mixture for seasoning and structure: Place a small skillet over high heat. Add a small amount of oil — just enough to cover the bottom of the pan in a thin layer. Cup a small amount (less than ¼ cup) of the mixture with your hands. Mixture will feel wet and will loosely hold together. Form into a ball, packing and cupping with your hands. When the oil shimmers, immediately lower the heat to medium and gently place the ball into the pan. Flatten with your hand or spatula to form a patty. Season with a pinch of salt. Let cook undisturbed for 2 to 3 minutes, or until evenly golden. Flip, and brown the other side for another 2 minutes or until evenly golden. Remove patty from pan and let cool briefly. Taste. If necessary, adjust mixture with more salt and pepper to taste. If the patty fell apart in the pan, crack in another egg to the bowl of quinoa/greens and mix to combine. When the mixture is tasting and holding together to your liking, use a 1/4-cup measure to portion out the remaining mixture into balls — you should get 10 to 12."
        },
        {
          "step": "Place a large skillet over high heat. When it simmers. Add balls to pan—they should sizzle when they hit the oil—then turn the heat down to medium or medium-low. Flatten balls gently with a spatula. Season with a pinch of salt. Cook undisturbed for 2 to 3 minutes or until golden. Use a spatula to flip the patties and cook for another 2 minutes or until golden. Pile onto a platter and serve with lemon, cilantro, naan, and sauce, if you wish."
        }
      ]
    },
    {
      "name": "Blackberry Pots de Crème",
      "author": "Erin McDowell",
      "author_url": "https://food52.com/users/3572-erin-mcdowell",
      "date": "October 8, 2016",
      "description": "Pot de crème is a baked custard - and therefore requires a bit more patience than it's quicker stovetop/cold set counterparts. It must slowly set in a low oven to achieve a silky texture, and most often is served chilled (so yes, more waiting). But the short ingredient list and easy method more than make up for it - it's a great dinner party friendly/make ahead dessert. —Erin McDowell",
      "ingredients": [
        {
          "ingredient": "12 ounces blackberries"
        },
        {
          "ingredient": "1/3 cup sugar"
        },
        {
          "ingredient": "2 1/4 cups heavy cream"
        },
        {
          "ingredient": "3/4 teaspoon vanilla extract"
        },
        {
          "ingredient": "6 egg yolks"
        }
      ],
      "directions": [
        {
          "step": "In a small pot, combine the blackberries and sugar over medium heat. Bring to a simmer, and cook until the berries break down – use the back of a spoon or a potato masher to help it along."
        },
        {
          "step": "Strain the mashed berries through a sieve, and transfer to a medium heat-safe bowl."
        },
        {
          "step": "Preheat the oven to 325°F. Place four-six oven-safe ramekins on a baking sheet. Heat a large kettle with water (you can also use a pot of water if needed) and heat until barely simmering."
        },
        {
          "step": "Whisk the cream and vanilla into the blackberry puree. Whisk the egg yolks together in a small bowl, then ladle a few scoops of the warm blackberry cream into the yolks, while whisking constantly."
        },
        {
          "step": "Whisk the yolk mixture back into the remaining blackberry mixture. Divide the mixture evenly between the ramekins and transfer the tray to the oven."
        },
        {
          "step": "Pour hot water (from the teapot or the pot you prepared) into the sheet tray – ideally the water should come 1/3 up the sides of the ramekins."
        },
        {
          "step": "Bake until the custards are set at the edges, but still jiggly in the center, 35-40 minutes."
        },
        {
          "step": "Let the custards cool for 30 minutes at room temperature, then transfer to the refrigerator to chill completely - at least 2 hours – before serving."
        }
      ]
    },
    {
      "name": "Crispy Kale, Roasted Butternut Squash & Tomato Pappardelle",
      "author": "Posie (Harwood) Brien",
      "author_url": "https://food52.com/users/18740-posie-harwood-brien",
      "date": "October 6, 2016",
      "description": "Inspired loosely from an old Barilla pasta recipe, this is perfect fall comfort food. The textures are particularly great: soft, wilted tomatoes, golden roasted butternut squash, and crispy kale. Feel free to use a different shape of pasta if you like. —Posie (Harwood) Brien",
      "ingredients": [
        {
          "ingredient": "1 pound dried pappardelle pasta"
        },
        {
          "ingredient": "1/2 bunch kale, washed and stems removed"
        },
        {
          "ingredient": "2 pints cherry tomatoes"
        },
        {
          "ingredient": "1 small butternut squash, peeled and cubed"
        },
        {
          "ingredient": "1 small yellow onion, diced"
        },
        {
          "ingredient": "1 clove garlic, minced"
        },
        {
          "ingredient": "1/2 cup dry white wine, optional (sub water if you prefer)"
        },
        {
          "ingredient": "salt and pepper to taste"
        },
        {
          "ingredient": "1/2 cup freshly grated Parmesan cheese"
        },
        {
          "ingredient": "olive oil for drizzling"
        }
      ],
      "directions": [
        {
          "step": "Preheat the oven to 400 degrees F."
        },
        {
          "step": "Drizzle the cherry tomatoes and cubed butternut squash liberally with olive oil and season with salt and pepper. Arrange in one layer on a rimmed baking sheet and bake until the tomatoes wilt and squash browns on the edges (the smaller you cube your squash, the crispier the edges will get, which I like!). This will take about 20-30 minutes, so start checking after 20 minutes."
        },
        {
          "step": "Meanwhile, tear the kale leaves into small pieces and drizzle them liberally with olive oil and season with salt and pepper. Arrange in a single layer on another rimmed baking sheet and bake for about 10-12 minutes, or until crispy. They burn easily so start checking after 10 minutes."
        },
        {
          "step": "Set the cooked vegetables aside. Bring a large pot of well-salted water to boil. Add the pasta and cook until just shy of al dente. Drain the pasta and set aside, reserving 1/2 cup of the pasta cooking water."
        },
        {
          "step": "Heat a tablespoon of olive oil in a large skillet over medium-high heat. Add the garlic and onion and cook until softened and fragrant, about 3 minutes. Add the white wine (or use water) and cook until the liquid is almost fully reduced."
        },
        {
          "step": "Add the cooked pasta and the reserved pasta water and toss together, cooking for about a minute."
        },
        {
          "step": "Remove from the heat and toss with the vegetables. Top each plate with a bit of freshly grated Parmesan cheese."
        }
      ]
    },
    {
      "name": "Genevieve Ko's Homemade Coco Puffs",
      "author": "Sarah Jampel",
      "author_url": "https://food52.com/users/124167-sarah-jampel",
      "date": "October 3, 2016",
      "description": "Genevieve's tips:\n- Puffs of all types taste good here. Just make sure they're light, airy ones, not hard, slightly inflated grains. I like Kashi Whole Grain Puffs.\n- Large flakes of coconut taste best here, but small strips work, as well. —Sarah Jampel",
      "ingredients": [
        {
          "ingredient": "2 tablespoons solid virgin coconut oil"
        },
        {
          "ingredient": "3 tablespoons unsweetened cocoa powder"
        },
        {
          "ingredient": "1/4 cup (85 grams) runny mild honey"
        },
        {
          "ingredient": "1/4 teaspoon salt"
        },
        {
          "ingredient": "1 teaspoon pure vanilla extract"
        },
        {
          "ingredient": "3 cups (92 grams) unsweetened puffed whole-grain cereal"
        },
        {
          "ingredient": "1/2 cup (47 grams) unsweetened coconut flakes"
        }
      ],
      "directions": [
        {
          "step": "Position a rack in the center of the oven and preheat it to 300° F. Line a half sheet pan with parchment paper."
        },
        {
          "step": "In a large saucepan over medium-low heat, whisk the coconut oil, cocoa powder, honey, and salt until smooth. Remove from the heat and whisk in the vanilla. Gently fold in the cereal and coconut until evenly coated, trying not to break up the coconut flakes. Spread the mixture into the prepared pan in an even layer, pushing it all the way to the edges."
        },
        {
          "step": "Bake until the puffs are a darker brown, about 25 minutes. Cool completely on the sheet on a wire rack. Break puffs into smaller clumps as you like."
        },
        {
          "step": "The puffs will keep at room temperature for up to 1 week or in the freezer for up to 2 months."
        }
      ]
    },
    {
      "name": "Thai Roasted Butternut Squash and Apple Soup with Coconut-Lime Cream",
      "author": "Beyondthebayou",
      "author_url": "https://food52.com/users/1033216-beyondthebayou",
      "date": "October 2, 2016",
      "description": "I'll be honest, I was quite hesitant with this recipe upon first glance. I rarely see soups that don't call for garlic, carrots, or celery. I don't love blended soups. It seemed like a lot of lime juice. Sriracha? Really? And it only takes 30 minutes? Jeez. Well, my doubts have been squashed (hehe)! The best part about this soup is the coconut milk/cream, which elevates it to a complexity level that I adore. I was tempted to amp up the Sriracha, because if we're going there, I'm going to go all the way. I'm glad I didn't—surely the Sriracha would have overpowered the coconut and that's definitely worth holding back for. The lime creates a necessary acid to balance this all out. I will say the apples I used didn't come through for me (I used Honeycrisp). Perhaps a tart green apple might show its flavors more.\nOverall, I was hugely impressed by this recipe. It came together in a snap, and would be very fun to adapt with other ingredients. —Amy Nelson",
      "ingredients": [
        {
          "ingredient": "4 cups butternut squash, chopped"
        },
        {
          "ingredient": "2 cups red apples, chopped"
        },
        {
          "ingredient": "1 cup sliced onion"
        },
        {
          "ingredient": "Olive oil"
        },
        {
          "ingredient": "Kosher salt"
        },
        {
          "ingredient": "Freshly ground black pepper"
        },
        {
          "ingredient": "5.6 ounces can of whole coconut milk"
        },
        {
          "ingredient": "2 limes"
        },
        {
          "ingredient": "2 cups chicken broth or stock"
        },
        {
          "ingredient": "1 teaspoon freshly minced ginger"
        },
        {
          "ingredient": "1 teaspoon Sriracha"
        },
        {
          "ingredient": "2 tablespoons Thai red curry paste"
        },
        {
          "ingredient": "1 cup red apple, diced"
        },
        {
          "ingredient": "Pepitas, for serving"
        }
      ],
      "directions": [
        {
          "step": "Preheat oven to 375° F."
        },
        {
          "step": "Toss butternut squash, the chopped apples, and the onions with a drizzle of olive oil. Season with salt and pepper and roast for 15-20 minutes until tender."
        },
        {
          "step": "Open up the can of coconut milk and scoop out the coconut fat and two tablespoons of the liquid into a small dish. Squeeze the juice of one lime and add a pinch of salt. Whisk and place the coconut-lime cream aside."
        },
        {
          "step": "Combine stock, roasted squash mixture, remaining coconut milk, ginger, Sriracha, Thai curry paste, and juice of one lime into a saucepan. Cook for 5 minutes. Taste for salt. Blend until smooth (in batches, if needed)."
        },
        {
          "step": "Heat a frying pan over medium heat, add a drizzle of olive oil and add the diced apple. Sauté for 5-6minutes. Place aside."
        },
        {
          "step": "Toast pepitas in a dry pan until some brown color develops and they slightly puff up."
        },
        {
          "step": "Serve the soup toped with the coconut-lime cream, sautéed apples, and pepitas."
        }
      ]
    },
    {
      "name": "Crème Caramel",
      "author": "Sarah Jampel",
      "author_url": "https://food52.com/users/124167-sarah-jampel",
      "date": "June 19, 2017",
      "description": "Okay, daredevils: This recipe's for you. It's the most challenging dessert in our quintet because you have to make caramel *and* custard *and* endure a 12-hour chilling period. And once that's all squared away, you must then invert the crèmes and cross your fingers that they slide out of the ramekins in good shape. If that doesn't make your heart rate increase, might I suggest bungee jumping?\nBut the results are worth it: a quivering pudding with a waterfall of caramel that sweetens every bite. To take the recipe a step further, infuse your cream—with crushed cardamom pods, orange zest, chopped coffee beans, Earl Grey tea leaves, or fresh herbs—before you begin.\nLightly adapted from Fine Cooking. —Sarah Jampel",
      "ingredients": [
        {
          "ingredient": "For the basic caramel:"
        },
        {
          "ingredient": "1 cup sugar"
        },
        {
          "ingredient": "1/4 teaspoon fresh lemon juice"
        },
        {
          "ingredient": "For the crème caramel:"
        },
        {
          "ingredient": "2 cups whole milk"
        },
        {
          "ingredient": "1 cup heavy cream"
        },
        {
          "ingredient": "2/3 cup sugar"
        },
        {
          "ingredient": "1/8 teaspoon table salt"
        },
        {
          "ingredient": "4 large eggs"
        },
        {
          "ingredient": "2 large egg yolks"
        },
        {
          "ingredient": "1 teaspoon pure vanilla extract"
        }
      ],
      "directions": [
        {
          "step": "Heat the oven to 325° F. Place eight 6-ounce ramekins in a large roasting dish."
        },
        {
          "step": "Make the basic caramel. Fill a small bowl with water and keep a pastry brush nearby—this is for washing the sides of the pan to stymy crystallization. In a heavy 2-quart saucepan, stir the sugar, lemon juice, and 1/4 cup cold water. Brush down the sides of the pan with your pastry brush to wash away sugar crystals."
        },
        {
          "step": "Bring to a boil over medium-high heat and cook, occasionally brushing down the sides of the pan, until the mixture starts to color around the circumference, 5 to 8 minutes."
        },
        {
          "step": "Gently swirl the pan once to even out the color and prevent isolated burning. Continue to cook until the sugar turns medium-dark amber, about 1 minute more. Immediately pour the hot caramel into the bottom of the ramekins, portioning equally."
        },
        {
          "step": "Working quickly, swirl each ramekin so that the caramel is about 1/2 inch up the sides. Set the ramekins, still in the roasting dish, aside and let the caramel harden."
        },
        {
          "step": "Fill a tea kettle or hot water heater and bring the water to a boil—you'll be using this for a bain marie. Combine the milk, cream, sugar, and salt in a medium saucepan and bring to a simmer over medium-high heat, stirring occasionally. Remove pan from the heat."
        },
        {
          "step": "Whisk eggs, egg yolks, and vanilla in a medium bowl and then temper the mixture by adding a couple ladles of the warm milk mixture, whisking constantly. When the egg mixture is very warm, add it back to the pot of milk and whisk constantly to combine. Pour through a fine mesh sieve into a liquid measuring cup or other spouted vessel. Then divide between the ramekins, filling each one."
        },
        {
          "step": "Pour the hot water from the kettle into the roasting dish so that it comes 1/3 of the way up the sides of the ramekin. Bake the custards in the water bath until the edges are set but the centers jiggle slightly when shaken, 30 to 35 minutes, rotating the pan halfway through the cook time. If the centers are still wavy, cook them a bit longer."
        },
        {
          "step": "Transfer the ramekins to a wire rack and let cool completely before covering each with plastic wrap and refrigerating for at least 12 hours (and up to 3 days)."
        },
        {
          "step": "To serve, run a small table knife around the edge of each ramekin to loosen the custard. (It's easiest if you take the custards straight from the fridge but warm the edges of the ramekin with a hot dish towel. Use a warm paring knife to help release the custard.) Quickly invert each custard onto a rimmed plate, using a side-to-side shaking motion if it does not release. Eat right away."
        }
      ]
    },
    {
      "name": "Chimichurri Chickpeas",
      "author": "Sarah Jampel",
      "author_url": "https://food52.com/users/124167-sarah-jampel",
      "date": "June 4, 2017",
      "description": "This salty-crunchy-fresh chickpea salad, which comes together in 10 minutes flat, will make you feel like you're cooking with no actual cooking at all, and it's as flexible as you feel when submerged in the pool.\nIf you don't have mint or cilantro (or if you only have one), compensate with other herbs. Chimichurri typically includes fresh oregano; you could add a couple tablespoons of just-torn leaves, or a teaspoon or two of the dried herb, or forgo it entirely. Swap out the red wine vinegar for white wine or rice wine vinegar. Maybe this isn't chimichurri anymore, but heck, you've made green sauce.\nMix in cooked grains, sliced snap peas, cucumber chunks, broiled shrimp, roasted fish. In the winter (seriously, can you even remember winter?), you might add boiled broccoli rabe, roasted squash or potatoes, and tears of rotisserie chicken. —Sarah Jampel",
      "ingredients": [
        {
          "ingredient": "For the chimichurri:"
        },
        {
          "ingredient": "1 cup packed flat-leaf parsley"
        },
        {
          "ingredient": "1/2 cup packed mint"
        },
        {
          "ingredient": "1/2 cup packed cilantro"
        },
        {
          "ingredient": "1 serrano or other hot green chile"
        },
        {
          "ingredient": "Pinch red pepper flakes, optional"
        },
        {
          "ingredient": "1 garlic clove, peeled"
        },
        {
          "ingredient": "1 tablespoon lime juice"
        },
        {
          "ingredient": "1 tablespoon sherry or white wine vinegar"
        },
        {
          "ingredient": "1/2 teaspoon kosher salt, plus more to taste"
        },
        {
          "ingredient": "1/4 cup olive oil"
        },
        {
          "ingredient": "For the salad:"
        },
        {
          "ingredient": "two 15-ounce cans chickpeas, drained and rinsed"
        },
        {
          "ingredient": "1 pint grape or cherry tomatoes, halved"
        },
        {
          "ingredient": "1/4 pound feta cheese, crumbled or cubed"
        },
        {
          "ingredient": "1/4 cup chopped toasted almonds"
        },
        {
          "ingredient": "Salt and freshly ground pepper, to taste"
        },
        {
          "ingredient": "Toasted or grilled bread and Greek yogurt, for serving (optional)"
        }
      ],
      "directions": [
        {
          "step": "To make the chimichurri, combine all the ingredients except the olive oil in a food processor. Process until everything is roughly chopped."
        },
        {
          "step": "Gradually stream in the olive oil, mixing until you have a well-blended sauce. Taste and adjust salt and lime juice levels."
        },
        {
          "step": "In a large bowl, combine all the ingredients with the chimichurri (start with only part of it, then add more to your liking). Season with salt and pepper."
        },
        {
          "step": "Serve over toasted or grilled bread spread with plain Greek yogurt, or mix it with cooked grains, or pile it alongside broiled fish or roasted vegetables."
        }
      ]
    },
    {
      "name": "Spicy, Creamy Chickpeas & Spinach (Chana Saag-ish)",
      "author": "Sarah Jampel",
      "author_url": "https://food52.com/users/124167-sarah-jampel",
      "date": "June 4, 2017",
      "description": "Once you have your garlic-ginger-chile paste prepped (and, hint, you don't have to use a blender or food processor—you could chop them very finely, then mash with water in a mortar and pestle, or even just stir the water and minced vegetables together), all you need to do is wilt spinach, dump in a couple cans of chickpeas, add a few tablespoons of cream, temper spices in hot oil, and you're done.\nIt's incredibly flavorful without asking that you rummage through the spice cabinet; it needn't be accompanied by a posse of starches or proteins to become a balanced dinner (though rice, or bread, or a swoosh of cucumber-flecked yogurt across the plate would be welcome); it's easily turned vegan (sub coconut milk for heavy cream, then top with toasted coconut flakes); and you can use frozen spinach instead of fresh. If you want to use frozen spinach instead of fresh, cook 2 packages of spinach according to the packaging directions, drain well, and proceed with the recipe.\nAdapted from Madhur Jaffrey's saag paneer in World of the East Vegetarian Cooking.\n—Sarah Jampel",
      "ingredients": [
        {
          "ingredient": "one 1-inch piece of ginger, peeled and roughly chopped"
        },
        {
          "ingredient": "3 cloves garlic, peeled"
        },
        {
          "ingredient": "1 serrano or other hot green chile, roughly chopped"
        },
        {
          "ingredient": "1/4 cup canola oil plus 1 tablespoon, divided"
        },
        {
          "ingredient": "1 1/2 pounds fresh spinach (or two 9-ounce packages frozen spinach, cooked according to the package and drained)"
        },
        {
          "ingredient": "1 dash Kosher salt"
        },
        {
          "ingredient": "two 15-ounce cans chickpeas, drained and rinsed"
        },
        {
          "ingredient": "4 tablespoons cream, divided"
        },
        {
          "ingredient": "1 teaspoon garam masala"
        },
        {
          "ingredient": "1 teaspoon cumin seeds"
        },
        {
          "ingredient": "1/4 teaspoon cayenne"
        }
      ],
      "directions": [
        {
          "step": "In a food processor, blender, or mortar and pestle, combine the ginger, garlic, and chile pepper with 1/4 cup of water so that you have a paste."
        },
        {
          "step": "Heat 1/4 cup canola oil in a large sauté pan or Dutch oven over medium heat. When it's hot, add the garlic-ginger-chile paste and cook, stirring constantly, for about 30 seconds, until the mixture is very fragrant. Add the spinach (it's okay to work in batches) and 1/2 teaspoon salt."
        },
        {
          "step": "Stir the spinach around for 1 minute to make sure all pieces are coated in oil, then cover the pan for 15 to 20 minutes, stirring occasionally. If all the water evaporates, add 1 or 2 tablespoons of water and continue cooking."
        },
        {
          "step": "Add the chickpeas, another 1/2 teaspoon of salt, and stir until the chickpeas are mixed into the spinach. Add 3 tablespoons of cream, stir to combine, then cover and cook for another 7 to 10 minutes, stirring occasionally."
        },
        {
          "step": "When the time is almost up, heat the last tablespoon of canola oil in a small pan on a separate burner. When the oil is hot, add the garam masala, cayenne, and cumin seeds. Fry, stirring, until the spices are fragrant and toasted."
        },
        {
          "step": "Immediately pour the spiced oil into the spinach-chickpea mixture. Add the last tablespoon of cream, stir everything to combine. Eat hot or at room temperature."
        }
      ]
    },
    {
      "name": "Walnut-Lentil Gyros with Spiced Yogurt",
      "author": "Sarah Jampel",
      "author_url": "https://food52.com/users/124167-sarah-jampel",
      "date": "May 31, 2017",
      "description": "Let's break down this walnut-lentil gyro (which, since it gladly forgoes the spit-roasted meat, is more gyro-inspired than gyro-compliant):\n- Walnut-lentil crumble: toasty walnuts are complemented by cooked lentils that have been sautéed at high heat so that they pop and crisp (a technique borrowed from Mark Bittman by way of Amanda Hesser), and everything is spiced with za'atar and cumin\n- Flatbread: on sandwich bread, this dish would be an architectural nightmare (imagine lentils in your pants pockets); instead, a flexible flatbread (or a pita) helps keep the wriggly walnuts and lentils contained\n- Spiced yogurt sauce: seasoned with lemon juice, za'atar, cumin, and garlic, it acts like glue, adhering the other components to the bread below\n- Hummus: if you have it in the fridge, it adds creaminess (and protein)\n- The fresh/sharp/vegetal accessories: arugula, pickled vegetables (I liked pickled beets, carrots, or onions), roasted red peppers\nIn the end, you have a complete meal that delivers the same satisfaction as a falafel-stuffed pita and as a roast beef sandwich, but that takes less time than either.\nFeel free to swap the hummus for baba ghanouj (if you're using it at all); skip the arugula with a smattering of torn parsley and cilantro; replace lemon with lime; add grilled zucchini instead of roasted peppers; or forgo the sandwich altogether because you've eaten the walnut-lentil crumble with the serving spoon. —Sarah Jampel",
      "ingredients": [
        {
          "ingredient": "For the spiced yogurt:"
        },
        {
          "ingredient": "1/3 cup Greek yogurt"
        },
        {
          "ingredient": "1/2 lemon"
        },
        {
          "ingredient": "1/4 teaspoon ground cumin"
        },
        {
          "ingredient": "1 teaspoon za'atar"
        },
        {
          "ingredient": "1 garlic clove"
        },
        {
          "ingredient": "Salt"
        },
        {
          "ingredient": "Pepper"
        },
        {
          "ingredient": "For the walnut-lentil crumble and assembly:"
        },
        {
          "ingredient": "2 tablespoons olive oil"
        },
        {
          "ingredient": "1 garlic clove"
        },
        {
          "ingredient": "1 jalapeño"
        },
        {
          "ingredient": "1 cup cooked green lentils"
        },
        {
          "ingredient": "1 cup coarsely chopped, toasted walnuts"
        },
        {
          "ingredient": "1/2 teaspoon ground cumin"
        },
        {
          "ingredient": "1 teaspoon za'atar"
        },
        {
          "ingredient": "1 pinch cayenne"
        },
        {
          "ingredient": "salt"
        },
        {
          "ingredient": "1/3 cup coarsely chopped flat-leaf parsley"
        },
        {
          "ingredient": "1/2 lemon (you can use the last of the lemon from above!)"
        },
        {
          "ingredient": "flatbreads"
        },
        {
          "ingredient": "hummus"
        },
        {
          "ingredient": "2 cups arugula"
        },
        {
          "ingredient": "roasted red peppers, sliced"
        },
        {
          "ingredient": "pickled beets, carrots, or onions (optional)"
        }
      ],
      "directions": [
        {
          "step": "To make the spiced yogurt, mix together all of the ingredients in a bowl. Taste and adjust seasoning to your like."
        },
        {
          "step": "To make the crumble, heat 2 tablespoons of olive oil in a large skillet over medium heat. When hot, reduce the heat to low, add sliced garlic and jalapeño, and cook, stirring, until the garlic is golden, 3 to 4 minutes. Add the cooked lentils to the pan along with the cumin and za’atar. Season with salt and stir to coat. Turn the heat back up to high and cook, stirring occasionally, until crispy and popping, 5 to 10 minutes. Lower the heat to medium-high, add the walnuts and the additional 2 teaspoons oil, and stir to coat. Cook for a minute or two more, until the walnuts are incorporated and warmed through. Add the parsley and a squeeze of lemon juice and stir to combine."
        },
        {
          "step": "To assemble, spread a flatbread with hummus, if using, then smear with the spiced yogurt. Top with a handful of arugula, sliced roasted red peppers, and any pickles of your choosing. Spoon the walnut-lentil crumble over top. Fold up and eat."
        }
      ]
    },
    {
      "name": "Base Recipe for Any Kind of Sweet Streusel",
      "author": "Emma Laperruque",
      "author_url": "https://food52.com/users/74020-emma-laperruque",
      "date": "May 29, 2017",
      "description": "At the little bakery where I work, we always have at least a couple gallons of streusel in the freezer. The type of streusel changes with the seasons, as our fruit pies shift from apple to pear, from strawberry to peach. Of all the recipe cards in our collection, streusel is the chillest chick at the party.\nIt takes just minutes to whip up, can be baked straight from the freezer, and keeps there for months. It can be piled on pies or layered into cakes. Or—à la Dorie Greenspan, who writes about “streusel crunch” in her book Dorie's Cookies—it can be baked solo on a sheet tray, then scattered over ice cream. Or yogurt. —Emma Laperruque",
      "ingredients": [
        {
          "ingredient": "2 cups all-purpose flour"
        },
        {
          "ingredient": "1 3/4 cups sugar"
        },
        {
          "ingredient": "3/4 teaspoon salt"
        },
        {
          "ingredient": "8 ounces cold unsalted butter, cut into cubes"
        }
      ],
      "directions": [
        {
          "step": "Combine the flour, sugar, and salt in a food processor. Add the butter and pulse until the mixture begins to form a crumbly, curdy—not cohesive—dough. Process more for big clumps and less for a pebbly, sandy texture. (You can also do this step in a bowl with your hands!)"
        },
        {
          "step": "Dump onto a plate and continue to squeeze and break-apart the mixture until it looks right to you. (Streusel is very personal. Don’t let anyone tell you otherwise!) Refrigerate for a few hours or freeze for 30-ish minutes until firm. (This will reinforce the streusel’s crumby personality.) Bag and store in the fridge for up to five days or in the freezer for up to 2 months."
        },
        {
          "step": "Put it to good use! Mound 1 to 1 1/2 cups on top of a pie before baking. For cake, follow your pan size and your heart, but figure a very thick layer of streusel in the middle and on top. The more, I say, the better. Or, to make streusel crunch, preheat the oven to 325° F and line a baking sheet with parchment or a Silicone mat. Spread into a single layer and bake until the streusel begins to brown and crisp—about 20 minutes total, tossing with a fork halfway through. It will continue to crisp as it cools. Cool completely before sprinkling on everything from yogurt and ice cream. (You can even serve it with milk, like the cereal of your dreams.) Store in an airtight bag or jar for up to 3 days."
        }
      ]
    },
    {
      "name": "Better-Than-a-Restaurant Home Fries",
      "author": "Brittany",
      "author_url": "https://food52.com/users/977242-brittany",
      "date": "May 2, 2017",
      "description": "WHO: One of the top 5 reasons Brittany married her husband was for his home fries (she is a smart woman!).\nWHAT: Crisp-yet-tender home fries with a serious garlic punch—and no frying.\nHOW: Purée half an onion with a whole head (yep!) of garlic, salt, paprika, and oil. Toss potato chunks in the oniony slush, then spread out on baking sheets and wait for the smell of frying potatoes.\nWHY WE LOVE IT: There’s no risk of soggy or burnt potatoes (and no par-boiling, or hot oil, or precarious flipping). Instead, the potato cubes bake in the oven coated in an onion-garlic-oil purée that bakes into a crispy crust while infusing every potato with flavor. —The Editors",
      "ingredients": [
        {
          "ingredient": "2 pounds red or yellow potatoes"
        },
        {
          "ingredient": "1/2 medium onion (about 2 ounces)"
        },
        {
          "ingredient": "1 head garlic"
        },
        {
          "ingredient": "1/2 cup frying oil (we use grapeseed)"
        },
        {
          "ingredient": "1 to 2 teaspoons salt"
        },
        {
          "ingredient": "1/2 teaspoon paprika"
        },
        {
          "ingredient": "1 teaspoon freshly ground black pepper"
        }
      ],
      "directions": [
        {
          "step": "Heat your oven to 475° F."
        },
        {
          "step": "Wash your potatoes, then cut into approximately 1-inch chunks (peeling if desired)."
        },
        {
          "step": "Place all remaining ingredients in a food processor, blender, or cup for use with an immersion blender. Purée."
        },
        {
          "step": "Toss potatoes with the onion mixture until thoroughly coated. You might have extra mix leftover if you used a large onion. Do not skimp on the coating; you want it *almost* too-wet looking."
        },
        {
          "step": "Spread evenly on a baking sheet (or two). Make sure the potatoes are evenly spread so they cook uniformly; I've always found it easier to use 2 pans with fewer spuds each than to cram them all on one."
        },
        {
          "step": "Roast in the hot oven until deeply browned and smelling fragrant. I start checking for doneness around the 30-minute mark to ensure they don't burn. If you had to use two pans and put them on two racks, make sure to rotate after 20 minutes or so."
        },
        {
          "step": "Serve immediately with ketchup, or my favorite: a 30/30/30 mix of ketchup, mustard, and horseradish cream."
        }
      ]
    },
    {
      "name": "Chocolate Brownies With Tofu",
      "author": "Eleni",
      "author_url": "https://food52.com/users/1241235-eleni",
      "date": "April 30, 2017",
      "description": "This recipe was selected as something to serve for a college student picnic since one of the students was vegan. Because of rain, we adjourned to a local pizza restaurant, but I made them the brownies for class. No one guessed the secret ingredient (tofu!) and the feedback was extremely positive. I would make these again if hosting a vegan. They are super simple to assemble, although it took some time to combine wet with dry. I found them difficult to cut and turned to my pizza cutter. —trvlnsandy",
      "ingredients": [
        {
          "ingredient": "2 cups dark brown sugar"
        },
        {
          "ingredient": "350 grams silken tofu"
        },
        {
          "ingredient": "2 tablespoons maple syrup"
        },
        {
          "ingredient": "1 tablespoon vanilla extract"
        },
        {
          "ingredient": "1 1/2 cups flour"
        },
        {
          "ingredient": "3/4 cup plus 1 tablespoon cocoa powder"
        },
        {
          "ingredient": "1 1/4 teaspoons baking powder"
        },
        {
          "ingredient": "1 teaspoon sea salt"
        },
        {
          "ingredient": "150 grams small and large semisweet chocolate chunks"
        }
      ],
      "directions": [
        {
          "step": "Preheat oven to 180° C/350° F. Line a (25- by 20- centimeter/10- by 8-inch) baking pan with parchment paper. [Editor's note: 8- by 8-inch also works.] Then grease the edges of the pan with vegetable oil."
        },
        {
          "step": "In a large food processor, add the sugar and silken tofu. Blend until it's lump free. Then add the vanilla and maple syrup and blend."
        },
        {
          "step": "In a separate bowl mix the flour, cocoa, baking powder, and salt. Combine the two mixtures by combining the dry ingredients into the food processor."
        },
        {
          "step": "Place half the mixture in the cooking pan. Sprinkle the chocolate chunks to cover the surface. Then pour the rest of the mixture on top."
        },
        {
          "step": "Bake for about 20 to 30 minutes, until the sides of the brownie start to pull away from the pan and a toothpick inserted in the middle comes out with little crumbs on it."
        },
        {
          "step": "Allow to cool completely before cutting. To store, place the pieces in an airtight container."
        }
      ]
    },
    {
      "name": "Red-Cooked Sauce (Chinese Mother Sauce #4)",
      "author": "Madame Huang",
      "author_url": "https://food52.com/users/313365-madame-huang",
      "date": "April 19, 2017",
      "description": "This is mainly deployed as a secret weapon in braises. Pork and chicken are the usual suspects, but vegans revel in these delightful flavors, too, by tossing things like sturdy vegetables, bean curd, or gluten in the mix to make a meatless dish worthy of the Lord Buddha himself. The key to this dish is using good Chinese soy sauces, mushroomy Shaoxing rice wine, and that touch of caramel. Read more about Chinese mother sauces here. —Madame Huang",
      "ingredients": [
        {
          "ingredient": "5 tablespoons peanut or vegetable oil"
        },
        {
          "ingredient": "16 thin slices fresh ginger"
        },
        {
          "ingredient": "5 scallions, trimmed and chopped into 1-inch pieces"
        },
        {
          "ingredient": "7 tablespoons regular soy sauce"
        },
        {
          "ingredient": "1 tablespoon dark soy sauce"
        },
        {
          "ingredient": "1 cup Shaoxing rice wine"
        },
        {
          "ingredient": "1/2 cup caramel (see the recipe for Sweet Soy Sauce, Chinese mother sauce #3), or rock sugar to taste"
        },
        {
          "ingredient": "Boiling water, as needed"
        },
        {
          "ingredient": "optional 3 whole star anise or 1/2 stick cinnamon"
        }
      ],
      "directions": [
        {
          "step": "Set your wok over medium-high heat, add the oil, and when the oil starts to shimmer, add the ginger and scallions, and stir these around until they brown. Add both soy sauces, the rice wine, the caramel syrup or rock sugar, and around a cup of boiling water. If you would like to add other seasonings, like garlic or spices, do it now."
        },
        {
          "step": "Simmer the ingredients for around 15 minutes. Taste the sauce and adjust the seasoning with more soy sauce or caramel or rice wine as desired. Strain out the solids, if you like, and refrigerate the sauce when you are not using it immediately."
        }
      ]
    },
    {
      "name": "Papad (Deep-Fried Lentil Wafers)",
      "author": "Annada Rathi",
      "author_url": "https://food52.com/users/98126-annada-rathi",
      "date": "April 14, 2017",
      "description": "Papad is a roasted or deep-fried crunchy lentil appetizer/wafer that is a staple of munchies in Indian restaurants. (I always take glee in the general unsuccessful attempts (mine included) to describe dishes like papad.) —Annada Rathi",
      "ingredients": [
        {
          "ingredient": "1 papad"
        },
        {
          "ingredient": "1 cup vegetable oil"
        }
      ],
      "directions": [
        {
          "step": "Buy any flavored papad from an Asian Indian grocery store. The most basic is the urad dal flavor. Others include black pepper, garlic, red chile, etc."
        },
        {
          "step": "Heat oil in a pan on medium heat. After 7 to 8 minutes, add papad. Be ready with a pair of tongs. Immediately the papad will change color to a bright hue. Flip it and take it out before it turns dark."
        },
        {
          "step": "If you want to avoid deep-frying, you can try roasting papad directly on the flame of stove. Hold papad with a pair of tongs over the flame. Flip and turn around constantly in order to avoid burn marks. Once the color turns to bright yellow, turn the heat off."
        },
        {
          "step": "It's best to make papad right before serving, as it loses its crunch with time."
        }
      ]
    },
    {
      "name": "Melissa Clark's Feta-Brined Roast Chicken",
      "author": "Genius Recipes",
      "author_url": "https://food52.com/users/31034-genius-recipes",
      "date": "April 12, 2017",
      "description": "There are many of us—most famously Julia Child—who would call a simply roasted chicken a perfect food, one that’s hard to imagine improving upon.\nBut while sometimes you want the simply-seasoned perfect sort of bird like Julia did, sometimes instead you want an herb-crusted, crackly-skinned, salty-briny-juicy pop in the mouth perfect sort of bird. This is the latter. Adapted slightly from the New York Times (January 28, 2015). —Genius Recipes",
      "ingredients": [
        {
          "ingredient": "4 ounces feta cheese, crumbled"
        },
        {
          "ingredient": "3 1/2 teaspoons kosher salt"
        },
        {
          "ingredient": "one 3 1/2- to 4-pound whole chicken"
        },
        {
          "ingredient": "1 to 2 tablespoons cracked black pepper, to taste"
        },
        {
          "ingredient": "2 tablespoons dried Greek oregano"
        },
        {
          "ingredient": "2 large lemons"
        },
        {
          "ingredient": "1/4 cup olive oil, plus more as needed"
        },
        {
          "ingredient": "1 large bunch arugula or other sturdy salad greens, for serving"
        }
      ],
      "directions": [
        {
          "step": "The day before serving, combine 2 ounces feta, 2 teaspoons salt, and 4 cups water in a blender and blend until smooth. Put chicken in an extra-large resealable plastic bag or a container large enough to submerge chicken, and cover with the feta brine. Refrigerate at least 8 hours or overnight."
        },
        {
          "step": "Before cooking, remove chicken from brine and transfer to a paper towel-lined tray. (Discard brine.) Pat chicken dry with paper towels and allow to come to room temperature for 1 hour."
        },
        {
          "step": "In a small mixing bowl, combine remaining 1 1/2 teaspoons salt, the pepper, the oregano, and the zest of the lemons (about 1 tablespoon). Liberally cover chicken in herb mix and gently massage entire bird. Halve lemons and place 3 halves in cavity (save remaining half for serving). Using kitchen twine, tie legs together."
        },
        {
          "step": "Heat oven to 450 degrees F. Place a large ovenproof skillet over high heat. Add oil and heat until it just smokes. Place chicken, breast-side up, in pan. Transfer entire pan to oven. Cook, basting once or twice, until an instant-read thermometer inserted in the fleshy part of the thigh reads 165 degrees F and the juices run clear when chicken is pierced with a knife, 50 to 60 minutes."
        },
        {
          "step": "Remove pan from oven, then stir remaining crumbled feta into juices in pan and stir well. Let chicken rest for 10 minutes in the pan before carving and serving on a bed of greens, with feta-laced pan juices on top, drizzled with a little lemon juice from the reserved lemon half."
        }
      ]
    },
    {
      "name": "Salatet Arnabeet Ma’ Tahineh Wa Bassal (Cauliﬂower Salad with Tahini & Onions )",
      "author": "joudie Kalla",
      "author_url": "https://food52.com/users/1222010-joudie-kalla",
      "date": "March 29, 2017",
      "description": "Cauliflower is eaten everywhere in Palestine and has been for thousands of years. Here is a super simple and quick recipe that I used to make in my restaurant, Baity Kitchen. It will most certainly be a head turner for those who normally shy away from such vegetables.\nPhotography by Ria Osbourne, food by Joudie Kalla and publisher Jacqui Small from Quatro publishing.\n—joudie Kalla",
      "ingredients": [
        {
          "ingredient": "For the salad:"
        },
        {
          "ingredient": "2 heads cauliflower, broken into florets"
        },
        {
          "ingredient": "3 tablespoons olive oil"
        },
        {
          "ingredient": "1 large red onion, sliced into half-moons"
        },
        {
          "ingredient": "2 teaspoons za'atar"
        },
        {
          "ingredient": "Sea salt"
        },
        {
          "ingredient": "1 bunch arugula"
        },
        {
          "ingredient": "150 grams (5 1/2 ounces) large green olives, preferably Middle Eastern"
        },
        {
          "ingredient": "2 tomatoes, cut into wedges"
        },
        {
          "ingredient": "1 red chile, sliced into rings"
        },
        {
          "ingredient": "For the dressing:"
        },
        {
          "ingredient": "4 tablespoons tahini"
        },
        {
          "ingredient": "2 tablespoons Greek yogurt"
        },
        {
          "ingredient": "Juice of 4 lemons"
        },
        {
          "ingredient": "2 teaspoons sea salt"
        }
      ],
      "directions": [
        {
          "step": "Preheat the oven to 425° F (220° C). Put the cauliflower florets on a baking tray. Pour over the oil and scatter over half the onions, the za'atar, and a sprinkle of salt and mix so that it is all coated. Bake for about 20 to 25 minutes."
        },
        {
          "step": "When the cauliflower has cooked and charred, remove the tray from the oven and add the arugula, olives, tomatoes, and sliced chile and mix together."
        },
        {
          "step": "To make the dressing, mix the tahini, yogurt, and lemon juice together in a small bowl. Add the salt and a little water if you need more liquid—you are aiming for the consistency of heavy cream. Once you have a nice tangy flavor that you are happy with, drizzle the dressing over the top of the cauliflower salad and serve warm."
        }
      ]
    },
    {
      "name": "Matzo Spanakopita",
      "author": "Sarah Jampel",
      "author_url": "https://food52.com/users/124167-sarah-jampel",
      "date": "March 25, 2017",
      "description": "\"Our version of matzo 'lasagna' gets the Greek treatment when married with the classic spinach pie. Here, matzo replaces the commonly used phyllo dough, giving the spanakopita heartiness and crunch, and coming closer to how it is prepared on the Greek islands. Serve it as a dairy side dish or a great vegetarian entrée. You may find you like this version even more than the traditional one!\"\nReprinted with permission from Matzo: 35 Recipes for Passover and All Year Long by Michele Streit Heilburn and David Kirschner (Clarkson Potter 2017). —Sarah Jampel",
      "ingredients": [
        {
          "ingredient": "For the sauce:"
        },
        {
          "ingredient": "4 tablespoons (1/2 stick) unsalted butter"
        },
        {
          "ingredient": "2 tablespoons potato starch"
        },
        {
          "ingredient": "2 cups whole milk"
        },
        {
          "ingredient": "1/2 cup grated Parmesan cheese"
        },
        {
          "ingredient": "1/4 teaspoon grated nutmeg"
        },
        {
          "ingredient": "1 teaspoon kosher salt"
        },
        {
          "ingredient": "For the spanakopita:"
        },
        {
          "ingredient": "3 tablespoons extra-virgin olive oil, divided"
        },
        {
          "ingredient": "1 cup sliced shallots"
        },
        {
          "ingredient": "1 garlic clove, thinly sliced"
        },
        {
          "ingredient": "1 pound fresh spinach or one 10-ounce package frozen chopped spinach, thawed and squeezed dry"
        },
        {
          "ingredient": "Kosher salt and freshly ground black pepper"
        },
        {
          "ingredient": "3 large eggs"
        },
        {
          "ingredient": "1 teaspoon grated lemon zest (from 1 lemon)"
        },
        {
          "ingredient": "4 sheets matzo"
        },
        {
          "ingredient": "1/2 cup grated Parmesan cheese"
        },
        {
          "ingredient": "3/4 cup crumbled feta cheese"
        },
        {
          "ingredient": "1/2 cup pine nuts, toasted"
        }
      ],
      "directions": [
        {
          "step": "To make the sauce, melt the butter in a small pot over medium heat. Whisk in the potato starch. Slowly pour in the milk and bring to a simmer, whisking continuously to prevent the sauce from becoming lumpy and sticking to the bottom of the pot. Simmer until the milk has thickened and the starchy flavor has cooked out, 3 minutes. Remove the pan from the heat."
        },
        {
          "step": "Whisk the Parmesan cheese, nutmeg, and salt into the sauce. Transfer to a small heatproof bowl, cover with a piece of plastic wrap directly on the surface to prevent a skin from forming, and refrigerate until fully cooled, about 20 minutes."
        },
        {
          "step": "Preheat the oven to 400° F. Line a colander with a clean kitchen towel and set in the sink. Brush an 8-inch square baking dish with 1 tablespoon of the olive oil."
        },
        {
          "step": "Heat the remaining 2 tablespoons olive oil in a large pot over medium-low heat. When it begins to shimmer, add the shallots and garlic and cook until soft and translucent, 5 minutes. Add the spinach, season with salt and pepper, and cover. Cook the spinach, stirring occasionally, until wilted, 6 minutes. Pour the vegetable mixture into the colander and use the kitchen towel to squeeze out as much moisture as possible. Set aside to cool."
        },
        {
          "step": "If using frozen spinach, add it to the pan with the sautéed shallots and garlic and cook until the spinach is dry and the mixture is evenly combined, about 2 minutes. Season with salt and pepper to taste and set aside to cool before incorporating into the recipe."
        },
        {
          "step": "Remove the cooled sauce from the refrigerator and whisk in the eggs. Stir the lemon zest into the spinach mixture. Lay one sheet of matzo in the bottom of the prepared baking dish. Cover with ½ cup sauce, then spread 1 cup of the spinach mixture over the sauce. Sprinkle with 1 tablespoon of the Parmesan, 3 tablespoons of the feta, and 3 tablespoons of the pine nuts. Place another sheet of matzo on top, pressing down gently. Repeat the layers, then cover the final sheet of matzo with the remaining sauce, Parmesan, and feta."
        },
        {
          "step": "Transfer to the oven and bake until the feta on top turns golden brown, the sauce puffs up, and the matzo softens, 30 to 35 minutes. Remove and allow the pie to rest for 10 minutes before slicing."
        }
      ]
    },
    {
      "name": "Refried White Beans",
      "author": "Sarah Jampel",
      "author_url": "https://food52.com/users/124167-sarah-jampel",
      "date": "March 19, 2017",
      "description": "Inspired by Nancy Silverton's but a lot easier. —Sarah Jampel",
      "ingredients": [
        {
          "ingredient": "one 15-ounce can white beans, drained and rinsed"
        },
        {
          "ingredient": "1 teaspoon plus 2 tablespoons olive oil, divided"
        },
        {
          "ingredient": "Salt, to season"
        },
        {
          "ingredient": "1/2 onion"
        },
        {
          "ingredient": "1 large or 2 small garlic cloves, smashed"
        },
        {
          "ingredient": "1 sprig rosemary"
        },
        {
          "ingredient": "2 dried chiles de árbol"
        },
        {
          "ingredient": "1/2 lemon"
        }
      ],
      "directions": [
        {
          "step": "Put the beans in a medium-sized pot. Add water to cover the beans, then add 1 teaspoon of oil, salt, the onion, and the garlic. Bring to a boil, then cover and simmer on low for 20 minutes, until the beans are very soft. Do not drain them."
        },
        {
          "step": "In a heavy-bottomed pot or wide skillet with high sides, heat the remaining 2 tablespoons of oil over medium-high. When hot, add the sprig of rosemary and the dried chiles. Cook until they're fragrant and sizzling."
        },
        {
          "step": "Turn the heat to medium-low and use a slotted spoon to transfer the beans from their pot to the new, hot one. Use a heavy spoon to smash the beans into a paste, leaving them as textured or smooth as you'd like."
        },
        {
          "step": "Ladle in about 1/4 cup of the bean-cooking water into the pot of partially-smashed beans. Cook, stirring, until the water has reduced. Repeat this process once more: Your beans should be stewy but not soupy, and not at all dry (if they are, add some more liquid). Taste and adjust the salt. Remove the chile pods and rosemary sprig. Squeeze the lemon over top, stir to combine, and serve."
        }
      ]
    },
    {
      "name": "Tartine Chocolate-Almond Cake",
      "author": "Sarah Jampel",
      "author_url": "https://food52.com/users/124167-sarah-jampel",
      "date": "March 16, 2017",
      "description": "Adapted from Tartine All Day: Modern Recipes for the Home Cook by Elisabeth Prueitt, copyright (c) 2017. Published by Lorena Jones Books/Ten Speed Press, an imprint of Penguin Random House LLC. —Sarah Jampel",
      "ingredients": [
        {
          "ingredient": "Unsalted butter, for the pans"
        },
        {
          "ingredient": "4 cups (480 grams) almond flour (sift it if there are lumps)"
        },
        {
          "ingredient": "3/4 cup plus 2 tablespoons (70 grams) cocoa powder, sifted"
        },
        {
          "ingredient": "1 teaspoon baking soda"
        },
        {
          "ingredient": "4 eggs"
        },
        {
          "ingredient": "6 tablespoons (75 grams) granulated sugar"
        },
        {
          "ingredient": "1/2 cup firmly packed (90 grams) brown sugar"
        },
        {
          "ingredient": "1/2 teaspoon sea salt"
        },
        {
          "ingredient": "2 teaspoons apple cider vinegar or distilled white vinegar"
        },
        {
          "ingredient": "1 1/2 cups (360 milliliters) whole milk"
        },
        {
          "ingredient": "2/3 cup (200 grams) raspberry, peach, strawberry, or apricot jam (optional)"
        },
        {
          "ingredient": "2 to 4 teaspoons water"
        },
        {
          "ingredient": "Lightly sweetened whipped cream, optional"
        }
      ],
      "directions": [
        {
          "step": "Preheat the oven to 350° F (180° C). Butter the sides of two 9-inch (23-centimeter) round cake pans and line the bottoms with parchment paper cut to fit exactly."
        },
        {
          "step": "In a bowl, combine the almond flour, cocoa powder, and baking soda and mix well, making sure that any lumps of almond flour are broken up."
        },
        {
          "step": "Using a handheld mixer or a stand mixer fi tted with the whisk attachment, beat the eggs, granulated sugar, brown sugar, and salt on high speed until very thick and pale in color, about 3 minutes. When you lift up the whisk, a ribbon of beaten eggs should trail back into the bowl."
        },
        {
          "step": "Whisk the vinegar and milk into the egg mixture. Pour the milk-egg mixture into the almond meal mixture and whisk until combined. Pour the batter into the cake pans. If the jam is too thick to drop off the spoon, slightly thin by stirring in the water."
        },
        {
          "step": "Evenly space dots of the jam over the tops of the cakes. Bake until the cake is set and a toothpick inserted into the center of the cakes comes out clean, 25 to 35 minutes."
        },
        {
          "step": "Set the pans on a cooling racks and let cool in the pans for 10 minutes. To unmold, run a butter knife around the sides of the pans to loosen the cakes, invert the cakes onto another rack, lift off the pans, and peel away the parchment. Place a serving plate over the bottom of one cake layer and turn the cake right-side up, top with half of the whipped cream. Place the second cake layer over the whipped cream. Top with the remaining whipped cream. Serve warm or at room temperature."
        }
      ]
    },
    {
      "name": "Vegetable Steamed Buns",
      "author": "Cindy",
      "author_url": "https://food52.com/users/520239-cindy",
      "date": "February 27, 2017",
      "description": "These fluffy, nutty steamed buns were a lot easier to make than I expected (once I started to get the hang of the folding process). Even my less-than-perfect ones tasted delicious, especially when paired with a drizzle of soy sauce and some chili paste. Definitely a fun project to try at home! —The Editors",
      "ingredients": [
        {
          "ingredient": "For the Dough:"
        },
        {
          "ingredient": "180 grams all purpose flour"
        },
        {
          "ingredient": "60 grams buckwheat flour"
        },
        {
          "ingredient": "1 teaspoon instant dry yeast"
        },
        {
          "ingredient": "1/2 tablespoon sugar"
        },
        {
          "ingredient": "1/3 teaspoon salt"
        },
        {
          "ingredient": "150 milliliters lukewarm water"
        },
        {
          "ingredient": "1/2 tablespoon flour"
        },
        {
          "ingredient": "For the filling:"
        },
        {
          "ingredient": "1 teaspoon sesame oil"
        },
        {
          "ingredient": "1 teaspoon neutral oil, such as canola"
        },
        {
          "ingredient": "1/4 medium sized cabbage, shredded thinly, about 1 1/2 cups"
        },
        {
          "ingredient": "2 shiitake mushrooms, chopped, about 1/4 cup"
        },
        {
          "ingredient": "1 small carrot, diced, about 1/4 cup"
        },
        {
          "ingredient": "1 teaspoon oyster sauce"
        },
        {
          "ingredient": "salt, to taste"
        }
      ],
      "directions": [
        {
          "step": "Combine both flours and salt in a large bowl. Combine water, sugar yeast and the 1/2 tsp flour in a seperate bowl. Combine wet and dry ingredients together to form a moist and soft dough. Add a splash of water or a sprinkle of flour as needed if the dough seems too wet or dry."
        },
        {
          "step": "Knead your dough on a lightly floured bench until smooth and glossy, about four minutes. Place in a bowl, cover with cling film or a damp towel and leave in a warm place to rise for one hour."
        },
        {
          "step": "Meanwhile, make your filling. Heat 1 teaspoon of neutral oil and 1 teaspoon of sesame oil in a medium pan."
        },
        {
          "step": "Add cabbage and stir fry for 1-2 minutes. Add a sprinkle of salt."
        },
        {
          "step": "Add carrot and shiitake mushrooms and stir fry for another 2 to 3 minutes. Add the oyster sauce and stir, then let filling cool until easy to handle. [Editor's Note: You will probably have a bit of filling leftover after forming the buns, which would be excellent scrambled into eggs, tossed with noodles, or added to fried rice.]"
        },
        {
          "step": "Cut out a piece of parchment paper to fit inside a 12-inch steamer basket. (You can use a smaller one as well, you just might have to make the buns in batches)."
        },
        {
          "step": "Divide dough into six balls and form each ball into a sphere, then roll it (using a rolling pin or your hands) into a wrapper about 5 inches in diameter. Rotate the dough by 90 degrees every once so often when you roll. (Tip: if your dough is too moist, it will not shape well, so use a dusting of flour if necessary!)"
        },
        {
          "step": "Using this helpful video (https://www.youtube.com/watch?v=guFb0CA0flc) as a guide, place a tablespoon of filling in the middle of wrapper, and fold sides of wrapper like a fan, to overlap each other. Place your finished, shaped buns on the parchment paper, leaving an inch of space between them."
        },
        {
          "step": "https://www.youtube.com/watch?v=guFb0CA0flc"
        },
        {
          "step": "Steam the buns over lightly simmering water for 12 minutes. Do Not Open The Lid throughout the steaming process!"
        },
        {
          "step": "After 12 minutes has passed, turn off the stove and let the buns sit for 5 minutes in the pot. Tilt your lid slightly on an angle make a small gap. Let buns sit for another 2 to 3 minutes. This process ensures your buns will be smooth and wrinkle-free."
        },
        {
          "step": "Remove and serve! I eat mine with some homemade pickled daikon and a marinated cucumber salad."
        },
        {
          "step": "Tip: After steaming, buns can be frozen and restated for a quick, yummy snack/lunch."
        }
      ]
    },
    {
      "name": "Brown Butter Tiger Nut Genoise",
      "author": "Alice Medrich",
      "author_url": "https://food52.com/users/64637-alice-medrich",
      "date": "February 26, 2017",
      "description": "Sifting the flour into the batter is only intended to aerate the flour and disperse any clumps; it is not intended to remove coarser particles that give texture to the cake— just sprinkle them back into the batter as you go!\nYou'll need a 8x2-inch round cake pan, stand mixer with whisk attachment, and medium mesh strainer or sifter for this recipe.\n—Alice Medrich",
      "ingredients": [
        {
          "ingredient": "6 tablespoons (85 grams) unsalted butter"
        },
        {
          "ingredient": "1 1/3 cups (125 grams) tiger nut flour"
        },
        {
          "ingredient": "1/2 cup plus 2 tablespoons (125 grams) sugar"
        },
        {
          "ingredient": "4 large cold eggs"
        },
        {
          "ingredient": "1 teaspoon vanilla"
        },
        {
          "ingredient": "1/4 teaspoon salt"
        },
        {
          "ingredient": "1/3 cup (35 grams) lightly toasted pecans, finely chopped or blitzed in a food processor"
        }
      ],
      "directions": [
        {
          "step": "Position a rack in the lower third of the oven and preheat the oven to 350°F. Line the bottom of the pan with parchment paper, but do not grease the sides of the pan."
        },
        {
          "step": "Heat the butter in a small pot until melted and bubbling; turn the heat off under the pot (or set aside if the burner is electric)—put it back on the heat as soon as you start to whip the eggs. Set a 4 to 5 cup bowl (preferably stainless steel) ready near the stove as well—the bowl must be big enough to allow you to fold butter and some batter together later."
        },
        {
          "step": "Combine the sugar, eggs, vanilla, and salt in the bowl of the stand mixer and beat on high speed, about 3 minutes, or until the mixture is pale and has increased in volume: you should see well defined-tracks as the whisk spins but when the whisk is lifted the mixture should flow and sink into the surface of the remaining eggs rather quickly—don’t continue beating all the way to the ribbon stage. You aren’t looking for a mixture so fluffy that it falls back in a thick fluffy rope that dissolves slowly on the surface of the remaining eggs!"
        },
        {
          "step": "While the eggs are beating, continue to cook the butter, swirling the pot, it until it is golden brown and the milk particles suspended in it are reddish brown. Immediately pour the butter into the reserved bowl to stop it from cooking further. (It should remain very hot until you need it.)"
        },
        {
          "step": "When the egg mixture is ready, remove the bowl from the mixer. Sift one-third of the flour over the eggs. Fold with a large rubber spatula until the flour is almost blended into the batter. Repeat with half of the remaining flour. Repeat with the rest of the flour and any bits of flour that did not pass though the strainer, and the nuts (if using). Fold until blended. Scrape about 1/4 of the batter to the hot browned butter. Fold until the butter is completely blended into the batter. Scrape the buttery batter over the remaining batter, and fold just until blended. Scrape the batter into the pan."
        },
        {
          "step": "Bake 30 to 35 minutes until the cake is golden brown, and springs back when lightly pressed with a finger. Set the pan on a rack. While the cake is still hot, ease a small thin knife or spatula around the inside of the pan, pressing against the sides of the pan to avoid tearing the cake."
        },
        {
          "step": "At your convenience (the cake can be warm or completely cool), invert the pan to remove the cake and peel off the parchment liner. Turn the cake right side up. (The cake should be completely cool before storing.) The cake may be wrapped airtight and stored at room temperature for 2 days, or frozen up to 3 months."
        }
      ]
    },
    {
      "name": "Crispy Prosciutto-Rosemary Khachapuri (Georgian Cheese Bread)",
      "author": "Erin McDowell",
      "author_url": "https://food52.com/users/3572-erin-mcdowell",
      "date": "February 25, 2017",
      "description": "A not-at-all classic version of khachapuri, the cheese-filled bread. Just before baking, I pile on pieces of prosciutto (which crisps up during baking) and rosemary (which perfumes the whole thing). —Erin McDowell",
      "ingredients": [
        {
          "ingredient": "For the dough"
        },
        {
          "ingredient": "4 1/3 cups (522 g) bread flour"
        },
        {
          "ingredient": "1 tablespoon (9 g) instant active dry yeast"
        },
        {
          "ingredient": "2 tablespoons (25 g) granulated sugar"
        },
        {
          "ingredient": "1 teaspoon (4 g) fine sea salt"
        },
        {
          "ingredient": "10 tablespoons (142 g) unsalted butter, at room temperature"
        },
        {
          "ingredient": "1 cup (242 g) whole milk, warmed to about 100°F"
        },
        {
          "ingredient": "1/3 cup (81 g) warm water"
        },
        {
          "ingredient": "For the filling and finishing"
        },
        {
          "ingredient": "1 1/2 cups goat cheese"
        },
        {
          "ingredient": "2 1/1 cups diced fresh mozzarella cheese"
        },
        {
          "ingredient": "Egg wash, as needed for finishing"
        },
        {
          "ingredient": "8 slices prosciutto"
        },
        {
          "ingredient": "1 tablespoon roughly chopped rosemary"
        }
      ],
      "directions": [
        {
          "step": "Make the dough: In the bowl of an electric mixer fitted with the dough hook attachment, mix the flour, yeast, sugar, and salt to combine. Add the butter and mix on low speed until the mixture looks crumbly, about 1 minute."
        },
        {
          "step": "Add the milk and water and mix the dough on low speed for 4 minutes. Raise the speed to medium and mix until the dough is very smooth, 2-3 minutes more."
        },
        {
          "step": "Transfer the dough to a large, oiled bowl and cover with plastic wrap. Let the dough rise for 1 1/2 to 2 hours, until the dough is puffed (it may not fully double in size)."
        },
        {
          "step": "Divide the dough as desired: Cut into two even pieces for larger, more shareable khachapuri, or into four even pieces for smaller, individual khachapuri."
        },
        {
          "step": "Pat the dough into an oval shape with your hands. On a lightly floured surface, roll out the dough, maintaining the oval shape, into an oblong oval about 1/3-inch thick."
        },
        {
          "step": "Pick the dough up from the ends and transfer it to a parchment lined baking sheet. Gently stretch the dough when you transfer it to help elongate the oval a bit."
        },
        {
          "step": "Crumble the goat cheese evenly over the dough, leaving about 1-inch around the edge on all sides. Sprinkle the mozzarella evenly over the goat cheese."
        },
        {
          "step": "Working your way around the bread, fold the excess dough up and over the filling to create a little wall and encase it. Gently pinch the ends of the oval to help seal. Cover the breads with a piece of plastic wrap sprayed with nonstick spray, and let the bread rise for 30 minutes – 1 hour."
        },
        {
          "step": "Preheat the oven to 375ºF. Brush the edges of the dough with egg wash."
        },
        {
          "step": "Arrange the prosciutto over the surface of the cheese—4 slices each for large kachapuri, 2 each for small. Sprinkle a bit of rosemary over each bread."
        },
        {
          "step": "Transfer to the oven and bake until the crust is golden brown, the cheese is melted and lightly golden, and the prosciutto is crisp, 30-35 minutes for small, 45-50 minutes for large."
        },
        {
          "step": "Let the khachapuri cool for 5-10 minutes before serving warm."
        }
      ]
    },
    {
      "name": "Bengali Orange Lentils with Cilantro and Tomatoes",
      "author": "Rinku Bhattacharya /Spice Chronicles",
      "author_url": "https://food52.com/users/3215-rinku-bhattacharya-spice-chronicles",
      "date": "February 22, 2017",
      "description": "These lentils are everyday fare in most Bengali homes. This recipe, adapted from the Bengali Five Spice Chronicles, is my mother's winter variation. The split husked masoor dal used in this recipe, ranges in color between pink to red, orange being the most common color.\nThe key to this recipe and any other Indian recipe is the process we call tempering or tarka. Seasoned oil is used to infuse flavor into the lentils. This can be done to perk up any dish such as leftover plain rice.\nTomato is not a native on Indian tables, but it surfaces, with all its red acidic freshness, in Indian winter markets. That is when it gets meshed into this recipe on my mother's table.\nThere are many layers of flavoring in the tempering: I often use only cumin, but my mother adds in some chopped fried onion. There are rules to the process of tempering or what we call shombora in Bengali. Not all tempering work with all lentils.\nIn my home, this calls my name most days, when the weather is cool or chilly. It is also wonderful just by itself as a soup. If you want to mute the spiciness, add the green chiles about 15 minutes into the cooking process. —Rinku Bhattacharya /Spice Chronicles",
      "ingredients": [
        {
          "ingredient": "3/4 cup split orange lentils"
        },
        {
          "ingredient": "1/2 teaspoon ground turmeric"
        },
        {
          "ingredient": "1 teaspoon salt, or to taste"
        },
        {
          "ingredient": "2 medium-sized Roma tomatoes, chopped (or 1 cup of drained chopped tomatoes from a can)"
        },
        {
          "ingredient": "1 tablespoon minced fresh ginger"
        },
        {
          "ingredient": "4 green Serrano chiles, tops removed, cut in half lengthwise"
        },
        {
          "ingredient": "3 tablespoons neutral oil, such as grapeseed"
        },
        {
          "ingredient": "1 small onion, diced (about 1/4 cup)"
        },
        {
          "ingredient": "2 teaspoons ghee or clarified butter"
        },
        {
          "ingredient": "1 1/2 teaspoons whole cumin seeds"
        },
        {
          "ingredient": "1 or 2 dried red chiles"
        },
        {
          "ingredient": "Torn cilantro, for garnish"
        }
      ],
      "directions": [
        {
          "step": "In a large pot, bring 3 cups of water to a boil."
        },
        {
          "step": "Add in the orange lentils, turmeric, salt, tomatoes, ginger, and green chiles. Cover the lentils, lower the heat, and simmer for 20 minutes. For a less spicy dish, add the green chiles about 15 minutes into the cooking process."
        },
        {
          "step": "Turn of the heat and mix well. You should have a smooth, bright yellow batch of lentils, with just a hint of integrity."
        },
        {
          "step": "Heat the oil in a separate pot, add in the onions and cook for about 6 to 7 minutes, until wilted soft and flecked golden."
        },
        {
          "step": "Add the clarified butter and the cumin seeds and the dried red chilies to the same pan (with the oil) and cook for about a minute, until the cumin seeds darken. Pour the seasoned oil and onion mixture over the lentils. Add some of the lentils into the tempering pan to sop up any remaining bit of flavored oil, then stir back into the larger pot. This is the process of creating the seasoning and tempering the lentils. Garnish with torn cilantro."
        },
        {
          "step": "Serve with steaming hot rice or freshly made flatbreads."
        }
      ]
    },
    {
      "name": "Passover Mina with Leek and Lamb",
      "author": "Leah Koenig",
      "author_url": "https://food52.com/users/618-leah-koenig",
      "date": "February 22, 2017",
      "description": "Mina is a rustic savory pie that is layered with either meat (usually lamb or beef) or cheese and vegetables like leeks, eggplant, spinach and, for the true carb-fiends, mashed potatoes. The matzo pieces are softened briefly in water or stock, rendering them pliable but still sturdy, akin to lasagna noodles. And the tops of the pies are brushed with an egg wash, leaving them with a shiny, lightly golden patina as they emerge, bubbling, from the oven. The word mina is Ladino (the indigenous Sephardic Jewish language) for “mine,” as in excavate—a perfect description for how one might approach eating such a densely packed strata.\nMina are a dream for cooks who like to play around with flavors and incorporate seasonal vegetables into their dishes. The layers need to include a fair amount of moisture (think: curd cheese whisked with milk, or chunky tomato sauce) so the pies do not turn out dry and brittle. And eggs help to bind things together in both the meat and dairy takes on mina. But as long as these golden rules are followed, pretty much anything goes. Toss in handfuls of chopped fresh parsley, mint, or dill, sauté up whatever vegetable looks good at the market and fold them into the filling, or deepen the sauce with warming spices. Whichever way you slice it, mina is a welcome addition to my and any Passover table. —Leah Koenig",
      "ingredients": [
        {
          "ingredient": "2 medium red potatoes (about 1 pound total), peeled and cut into 1/4-inch slices"
        },
        {
          "ingredient": "2 tablespoons vegetable oil"
        },
        {
          "ingredient": "3 large leeks (white and light green parts), thinly sliced"
        },
        {
          "ingredient": "2 medium shallots, finely chopped"
        },
        {
          "ingredient": "Kosher salt and freshly ground black pepper"
        },
        {
          "ingredient": "1 pound ground lamb"
        },
        {
          "ingredient": "5 ounces baby spinach leaves (about 6 cups)"
        },
        {
          "ingredient": "4 cloves garlic, finely chopped"
        },
        {
          "ingredient": "1 1/2 teaspoons ground cinnamon"
        },
        {
          "ingredient": "1 1/2 teaspoons ground cumin"
        },
        {
          "ingredient": "1/4 teaspoon allspice"
        },
        {
          "ingredient": "1 28-ounce can crushed tomatoes"
        },
        {
          "ingredient": "5 eggs"
        },
        {
          "ingredient": "9 sheets matzo"
        },
        {
          "ingredient": "Finely chopped flat-leaf parsley, for serving"
        }
      ],
      "directions": [
        {
          "step": "Bring a medium pot of salted water to a boil. Add the potatoes and cook, stirring once or twice, until potatoes are softened but not falling apart, 12 to 15 minutes. Drain potatoes and set aside to cool to the touch."
        },
        {
          "step": "Heat the oil in a large skillet set over medium heat. Add the leeks, shallots, and a pinch of salt and cook, stirring occasionally, until softened, about 10 minutes. Add the lamb and cook, breaking up the meat into small pieces with the back of a spoon, until browned, about 5 minutes. Carefully pour off any excess fat, then add the spinach, garlic, cinnamon, cumin, and allspice; cook until spinach wilts and mixture is fragrant, 2 to 3 minutes. Add crushed tomatoes, 1 teaspoon of salt, and a generous amount of black pepper. Cook, stirring occasionally, until slightly thickened, about 5 minutes. Remove from heat and let cool to room temperature. Crack 4 of the eggs into the cooled sauce and stir to fully combine."
        },
        {
          "step": "Heat the oven to 350° F and grease a 9 by 13 inch baking dish. Fill another shallow baking dish with warm water and dip in 3 sheets of matzo. Let the matzo soften for 2 to 3 minutes (no longer; you want it to be flexible but not mushy). Shake off the excess water and arrange the matzo sheets in the bottom of the baking dish. Break the third matzo, if necessary, to fit it into the dish. Cover with a layer of the potato slices (you might not use all of them), followed by approximately half of the tomato-lamb sauce. Repeat process with 3 more softened matzo sheets and the remaining tomato-lamb sauce."
        },
        {
          "step": "Soften the remaining 3 sheets of matzo and arrange on top. Whisk the remaining egg in a small bowl and brush evenly and generously over the top of the matzo. Bake until golden brown, 40 to 45 minutes. Remove from oven and let stand 10 minutes. Sprinkle with parsley just before serving."
        }
      ]
    },
    {
      "name": "Burmese Tofu (a.k.a. Chickpea Flour Tofu)",
      "author": "Sarah Jampel",
      "author_url": "https://food52.com/users/124167-sarah-jampel",
      "date": "February 22, 2017",
      "description": "Chickpeas can do a lot, but chickpea flour? It might be even more versatile. In the case of Burmese tofu (also known as Shan tofu for the state in the northeast part of the country where it originated), chickpea flour gets mixed with water and cooked into a gruel that resembles polenta. It's then transferred to a pan, where it cools into a firm but forgiving block that also resembles... well... polenta—but with a smooth jiggle and a nutty, bitter edge that makes it enjoyable to eat as-is, cube by cube.\nIt's got what I've always longed for from flabby, supermarket soy tofu (and polenta, too, for that matter): bold flavor, velvety texture. And, unlike tofu, it's easy to make at home.\nThis recipe is barely adapted from Sarah Britton of My New Roots, who followed a recipe on NetCooks from Christina Aung. —Sarah Jampel",
      "ingredients": [
        {
          "ingredient": "1 1/2 cups (175 grams) chickpea flour (or besan)"
        },
        {
          "ingredient": "7 1/2 cups water"
        },
        {
          "ingredient": "1 teaspoon coconut oil or ghee"
        },
        {
          "ingredient": "1 teaspoon fine grain sea salt"
        },
        {
          "ingredient": "1 1/2 teaspoons ground turmeric (optional)"
        },
        {
          "ingredient": "1/2 teaspoon garlic powder (optional)"
        }
      ],
      "directions": [
        {
          "step": "In a very large bowl, stir together the chickpea flour and the water until no dry spots remain. Cover with a kitchen towel and leave undisturbed for 8 to 12 hours."
        },
        {
          "step": "By this point, the mixture will have separated and you'll have a fair amount of cloudy water on top. Use a ladle to remove 6 cups of that water from the top of the bowl. Line an 8- by 8-inch baking pan with cheesecloth or a dish towel you don't care about staining."
        },
        {
          "step": "In a medium saucepan, melt the oil or ghee over medium heat. Pour the remaining liquid from the top of the bowl into the pan (it's okay if you have to leave a little of it behind) and add the salt, turmeric, and garlic powder and whisk to combine. Cook over medium heat, stirring frequently, for 20 to 25 minutes, until the mixture simmers and thickens."
        },
        {
          "step": "Now pour in the chickpea sludge. The mixture will start to thicken instantly. Whisk for 5 to 10 minutes, until the mixture is very thick and starting to pull away from the pan."
        },
        {
          "step": "Pour the thickened chickpea mixture into the pan and smooth out the top. Fold the edges of the cheesecloth or towel over top and let sit at room temperature for 6 to 8 hours."
        },
        {
          "step": "Flip the pan onto a cutting board, pull away the cloth, and slice into cubes or strips. Store in the fridge for up to 1 week."
        },
        {
          "step": "I pan-fried pieces in a non-stick pan in a bit of hot olive oil, which made them crisp on the outside and creamy on the inside, but the tofu is good as-is, too. (I had a bit of trouble pan-frying the tofu in pans that were not non-stick.)"
        }
      ]
    },
    {
      "name": "Ramos Gin Fizz",
      "author": "Sarah Baird",
      "author_url": "https://food52.com/users/927517-sarah-baird",
      "date": "February 20, 2017",
      "description": "Recipe from New Orleans Cocktails: Over 100 Drinks from the Sultry Streets and Balconies of the Big Easy by Sarah Baird. —Sarah Baird",
      "ingredients": [
        {
          "ingredient": "2 ounces gin"
        },
        {
          "ingredient": "1 ounce half and half"
        },
        {
          "ingredient": "3/4 ounce simple syrup"
        },
        {
          "ingredient": "1/2 ounce lemon juice"
        },
        {
          "ingredient": "1/2 ounce lime juice"
        },
        {
          "ingredient": "2 dashes orange blossom water"
        },
        {
          "ingredient": "1 egg white"
        },
        {
          "ingredient": "Soda, to top"
        }
      ],
      "directions": [
        {
          "step": "In a cocktail shaker, combine all the ingredients. Cover and shake for 15 to 20 seconds."
        },
        {
          "step": "Fill the shake a quarter full with ice and shake for 3 to 5 minutes. Really give your biceps a workout and shake that bad boy as hard as you can (preferably with two hands). It's important to create a creamy consistency."
        },
        {
          "step": "Pour into a chilled Collins glass and top with soda until foamy head forms."
        }
      ]
    },
    {
      "name": "Spicy Cilantro Vinaigrette",
      "author": "Gena Hamshaw",
      "author_url": "https://food52.com/users/70454-gena-hamshaw",
      "date": "June 15, 2016",
      "description": "This dressing is shown on the far left in the photo above. —Gena Hamshaw",
      "ingredients": [
        {
          "ingredient": "1/2 cup extra-virgin olive oil"
        },
        {
          "ingredient": "4 tablespoons freshly squeezed lime juice"
        },
        {
          "ingredient": "1 tablespoon maple syrup"
        },
        {
          "ingredient": "1/2 teaspoon salt"
        },
        {
          "ingredient": "1/2 cup tightly packed fresh cilantro"
        },
        {
          "ingredient": "Pinch cayenne (to taste)"
        },
        {
          "ingredient": "1/2 teaspoon cumin (optional)"
        }
      ],
      "directions": [
        {
          "step": "Blend all the ingredients together in a blender or food processor. Store in an airtight container in the fridge. The dressing will keep for a week."
        }
      ]
    },
    {
      "name": "Gluten-Free Lemon Poppy Seed Bars (Lemonies!)",
      "author": "Sarah Jampel",
      "author_url": "https://food52.com/users/124167-sarah-jampel",
      "date": "June 15, 2016",
      "description": "More snack cake than fudge, these \"lemonies\" are adapted from a Food52 fan favorite, Blondies -- Gluten-Free and Completely Delicious. Mascarpone gives them levity and lemon juice cuts some of the brown sugar sweetness (but add the optional glaze if you want some of that back). —Sarah Jampel",
      "ingredients": [
        {
          "ingredient": "For the bars:"
        },
        {
          "ingredient": "8 tablespoons (1 stick) butter, melted (preferably on the stove so that it gets a bit browned) and cooled slightly"
        },
        {
          "ingredient": "2 cups light brown sugar"
        },
        {
          "ingredient": "2 eggs, at room temperature"
        },
        {
          "ingredient": "1 1/2 teaspoons vanilla extract"
        },
        {
          "ingredient": "2 tablespoons lemon juice"
        },
        {
          "ingredient": "1 tablespoon lemon zest"
        },
        {
          "ingredient": "4 ounces mascarpone or softened cream cheese"
        },
        {
          "ingredient": "1 1/2 cups almond flour"
        },
        {
          "ingredient": "1/2 cup coconut flour"
        },
        {
          "ingredient": "1/2 teaspoon salt"
        },
        {
          "ingredient": "1/4 cup poppy seeds"
        },
        {
          "ingredient": "For the optional glaze:"
        },
        {
          "ingredient": "1 1/2 cups confectioners' sugar"
        },
        {
          "ingredient": "2 tablespoons lemon juice"
        },
        {
          "ingredient": "1 teaspoon lemon zest"
        },
        {
          "ingredient": "2 tablespoons poppy seeds"
        }
      ],
      "directions": [
        {
          "step": "Preheat oven to 350° F and line a 9- by 13-inch pan with parchment, leaving flaps hanging over the side (to use as handles later)."
        },
        {
          "step": "Mix your no-longer-hot melted butter and brown sugar vigorously with a whisk, spoon, or stand mixer until evenly caramel-colored and smooth."
        },
        {
          "step": "Add eggs one at a time, mixing them in thoroughly. Stir in vanilla, lemon zest, lemon juice, and mascarpone."
        },
        {
          "step": "In a separate bowl, whisk together the flours, salt, and poppy seeds. Now mix them into the wet ingredients. Overmixing isn't too much of an issue, but there's no reason to go overboard."
        },
        {
          "step": "Spread your thick batter evenly into your prepared pan, tapping it against the counter to get out any air bubbles. Bake for 35 to 40 minutes (depending on your desired gooeyness factor)."
        },
        {
          "step": "While the blondies bake, whisk together all the glaze ingredients until smooth. Remove from oven and cool completely in pan—it's even a good idea to give them a rest in the fridge or freezing before slicing!"
        }
      ]
    },
    {
      "name": "Frozen Vegan Coconut Chocolate Almond Bars",
      "author": "Asha Loupy",
      "author_url": "https://food52.com/users/353685-asha-loupy",
      "date": "June 14, 2016",
      "description": "WHO: Asha Loupy an Oakland-based food blogger. You might remember her last contest win—Savory Potato & Onion Knishes!\nWHAT: A chocolatey vegan (!) frozen dessert with a tofu secret.\nHOW: Press an almondy-coconutty-graham cracker crust into a sheet pan, then smooth a thick layer of chocolate- and coconut cream-spiked silken tofu over it. Freeze, top with whipped coconut cream and toasted coconut flakes, and snack on fat, cold wedges.\nWHY WE LOVE IT: You wouldn't know these bars are vegan, and yet! The crust is sweet and nutty, the tofu indiscernible but still lending richness, and the coconut cream a sort of vegan icing on the cake (or ice cream bars, as it were). It's also quick to assemble and could easily be made well in advance. —The Editors",
      "ingredients": [
        {
          "ingredient": "Crust and Filling:"
        },
        {
          "ingredient": "1/2 cup raw almonds, roughly chopped"
        },
        {
          "ingredient": "1/2 cup unsweetened shredded coconut"
        },
        {
          "ingredient": "4 1/2 ounces graham crackers, roughly broken (4 1/2 ounces is about 1 sleeve)"
        },
        {
          "ingredient": "3 tablespoons granulated sugar"
        },
        {
          "ingredient": "1/4 teaspoon sea salt"
        },
        {
          "ingredient": "8 tablespoons coconut oil, melted"
        },
        {
          "ingredient": "12 ounces silken tofu, drained and patted dry"
        },
        {
          "ingredient": "1 1/2 cups semisweet or bittersweet chocolate (dairy-free), roughly chopped"
        },
        {
          "ingredient": "1/2 cup coconut cream, or full-fat coconut milk"
        },
        {
          "ingredient": "Toppings"
        },
        {
          "ingredient": "1 14-ounce can coconut cream, chilled overnight"
        },
        {
          "ingredient": "3 tablespoons powdered sugar"
        },
        {
          "ingredient": "1/2 teaspoon vanilla extract"
        },
        {
          "ingredient": "1/2 cup sliced almonds, toasted"
        },
        {
          "ingredient": "1/2 cup sweetened or unsweetened shaved dried coconut (I like Dang Coconut Chips), toasted"
        }
      ],
      "directions": [
        {
          "step": "Preheat the oven to 350° F. Line a quarter sheet pan (9x13 inches) with parchment paper."
        },
        {
          "step": "Place almonds and coconut in the bowl of a food processor and pulse a couple times until they resemble coarse sand. Add the broken graham crackers, sugar, and salt, and continue to pulse until the crackers, almonds and coconut are crushed into fine crumbs."
        },
        {
          "step": "Transfer almond, coconut, and graham cracker crumbs into a medium bowl. Pour the melted coconut oil over the mixture and stir until the crumbs are evenly coated."
        },
        {
          "step": "Pour graham cracker crust mixture onto the prepared sheet pan and press into an even layer on the bottom and up the sides of the pan. Bake for 8 to 10 minutes until golden brown. Remove from the oven and let cool to room temperature."
        },
        {
          "step": "While the crust is cooling, make the filling: Melt the chocolate in a double boiler (you can also do this in the microwave in 30-second increments). Add the melted chocolate, tofu, and coconut cream to a blender and blend until smooth, about 1 to 2 minutes, scraping down the sides as necessary. If you are having trouble getting the mixture going, you can add a tablespoon of water to help it blend."
        },
        {
          "step": "Pour the chocolate tofu mixture over the cooled graham cracker crust and spread evenly. Place in the freezer for at least 2 hours."
        },
        {
          "step": "Remove the frozen coconut chocolate almond bars from the freezer about 10 minutes before you want to serve them. While they are sitting, make the coconut whipped cream: Scoop out the chilled solid coconut cream (leave any liquid behind) and place in a large bowl. Using an electric mixer, whip on high for 30 seconds. Add the sugar and vanilla extract and continue to whip until the mixture is light and airy, about 1 to 2 minutes."
        },
        {
          "step": "Spread coconut whipped cream evenly over the top of the bars and garnish with toasted almonds and coconut shavings. It is easiest to slice with a warm, dry knife (dip your knife in hot water and then wipe off with a towel). Enjoy!"
        }
      ]
    },
    {
      "name": "Risotto-Style Pasta with Asparagus and Lemon",
      "author": "Sarah Jampel",
      "author_url": "https://food52.com/users/124167-sarah-jampel",
      "date": "June 12, 2016",
      "description": "Adapted from Kate Flaim, via Design Sponge, and Alain Ducasse. —Sarah Jampel",
      "ingredients": [
        {
          "ingredient": "5 1/2 cups vegetable broth (or light chicken stock)"
        },
        {
          "ingredient": "2 tablespoons olive oil"
        },
        {
          "ingredient": "3 shallots, thinly sliced"
        },
        {
          "ingredient": "Salt and pepper, for seasoning"
        },
        {
          "ingredient": "1 pound short, good-quality pasta (Ducasse recommends artisanal strozzapreti; I used penne)"
        },
        {
          "ingredient": "1 bunch asparagus, woody ends removed and sliced into 1-inch pieces if large and burly"
        },
        {
          "ingredient": "Freshly grated Parmesan"
        },
        {
          "ingredient": "Zest of 1/2 lemon"
        },
        {
          "ingredient": "Crumbled feta (optional)"
        }
      ],
      "directions": [
        {
          "step": "Pour the broth into a small saucepan and bring to a gentle simmer on the stovetop."
        },
        {
          "step": "On another burner, heat the olive oil in a large, wide skillet. Add the shallots and a pinch of salt and sauté, stirring occasionally, until softened, 1 to 2 minutes."
        },
        {
          "step": "Add the dried pasta and stir it around to coat it in the oil and the shallots."
        },
        {
          "step": "Use a ladle to transfer about 1 1/2 cups of stock from the saucepan to the pasta skillet."
        },
        {
          "step": "Cook, stirring gently, until nearly all stock has evaporated. Add another cup of stock, and cook, stirring, until nearly all the liquid has been absorbed, but not all—like you're making risotto. Add more stock from time to time until the pasta is al dente (taste frequently!), about 18 minutes. When your pasta is about 5 minutes from being done, add the asparagus pieces—you want to make sure they're cooked through by the time the pasta is ready."
        },
        {
          "step": "When the pasta is at the desired firmness, take it off the heat, shower with Parmesan and lemon zest and fold to incorporate. Serve immediately."
        }
      ]
    },
    {
      "name": "One-Pot Garlic Parmesan Pasta (a.k.a. the Lazy Cook's Fettuccine Alfredo)",
      "author": "Sarah Jampel",
      "author_url": "https://food52.com/users/124167-sarah-jampel",
      "date": "June 12, 2016",
      "description": "No need to make a separate sauce for your pasta: In this recipe, from the blog Damn Delicious (yep, that's right), dry pasta is boiled in a mixture of milk and broth. Because the pasta releases its starches as the liquids reduce and concentrate, you end up with a creamy, flavorful coating. Experiment with adding red pepper flakes, tomato paste, or chopped herbs (basil!) when you add the garlic. —Sarah Jampel",
      "ingredients": [
        {
          "ingredient": "1 tablespoon olive oil"
        },
        {
          "ingredient": "4 cloves garlic, minced"
        },
        {
          "ingredient": "2 cups vegetable broth (or chicken stock)"
        },
        {
          "ingredient": "1 cup milk (more as needed)"
        },
        {
          "ingredient": "2 tablespoons unsalted butter"
        },
        {
          "ingredient": "8 ounces fettuccine or other long noodle"
        },
        {
          "ingredient": "Salt and pepper, to taste"
        },
        {
          "ingredient": "1/4 cup freshly grated Parmesan"
        },
        {
          "ingredient": "Chopped parsley, for garnishing"
        }
      ],
      "directions": [
        {
          "step": "In a large, wide skillet over medium-high heat, heat the olive oil. Add the garlic and cook, stirring frequently, until fragrant, 1 to 2 minutes."
        },
        {
          "step": "Stir in the broth, milk, butter, and dry pasta. Season with salt and pepper."
        },
        {
          "step": "Bring to a boil, then reduce the heat to a simmer and cook, stirring occasionally, until the pasta is cooked through, 15 to 18 minutes. Stir in the Parmesan and add additional milk if the sauce is too thick."
        },
        {
          "step": "Garnish with parsley and serve immediately."
        }
      ]
    },
    {
      "name": "Tofu, Aubergine, and Beluga Lentils with Pomegranate Molasses",
      "author": "morning glory",
      "author_url": "https://food52.com/users/994502-morning-glory",
      "date": "June 12, 2016",
      "description": "I really enjoyed this dish and was surprised by the mix of flavors. The only thing that would have made this dish better would be the added spiciness: The sauce thickened in about 8 minutes, which didn't leave much time for the chilis to infuse their flavor. The pomegranate molasses added a really nice sweetness to the dish and the five-spice balanced it out. I would definitely make this dish again, though I'd simmer it for longer to get more heat out of the chilis, and sub chicken for tofu. —Angela",
      "ingredients": [
        {
          "ingredient": "300 grams tofu [Editors' note: We used firm tofu.)"
        },
        {
          "ingredient": "1 aubergine"
        },
        {
          "ingredient": "1/2 large onion"
        },
        {
          "ingredient": "125 grams cooked beluga (black) lentils"
        },
        {
          "ingredient": "400 grams tin of chopped tomatoes"
        },
        {
          "ingredient": "1 tablespoon pomegranate molasses"
        },
        {
          "ingredient": "1 tablespoon soy sauce"
        },
        {
          "ingredient": "1 teaspoon chili powder"
        },
        {
          "ingredient": "2 teaspoons five-spice powder"
        },
        {
          "ingredient": "2 teaspoons ground coriander"
        },
        {
          "ingredient": "3 bird's eye chilis"
        },
        {
          "ingredient": "3 to 4 tablespoons vegetable oil"
        },
        {
          "ingredient": "Mint or coriander (cilantro) leaves to garnish"
        }
      ],
      "directions": [
        {
          "step": "Heat the oven to 180° C (356° F)."
        },
        {
          "step": "Chop the aubergine into small chunks and place on a non-stick oven tray. Drizzle over 2 tablespoons oil and toss the aubergine until coated."
        },
        {
          "step": "Bake aubergine in the oven for 20 to 25 mins until softened and slightly crispy."
        },
        {
          "step": "Drain the tofu (it usually comes in a pack with liquid) and press with paper kitchen towels until as dry as possible. Cut into chunks."
        },
        {
          "step": "Fry the tofu pieces gently in 1 tablespoon oil, turning as required, until slightly golden on all sides."
        },
        {
          "step": "Put the pomegranate molasses, soy sauce, and chili powder into a bowl and mix. Add the tofu pieces and turn them in the marinade. Leave to soak while you prepare the sauce."
        },
        {
          "step": "Gently fry the chopped onion in 1 tablespoon of oil until it is softened. Add the spices and fry gently for a few minutes, adding a little water if necessary."
        },
        {
          "step": "Add the tinned tomatoes and the whole chilis, pierced with a sharp knife to release their flavor. Cook for ten minutes on a medium heat to reduce and thicken the sauce. Check for seasoning and add salt if required. Add the lentils and heat through."
        },
        {
          "step": "Add the eggplant and tofu to the sauce and then heat through over low heat for 10 minutes."
        },
        {
          "step": "Sprinkle shredded mint or chopped coriander (cilantro) leaves to garnish."
        }
      ]
    },
    {
      "name": "Strawberry Ice with Condensed Milk and Whipped Cream",
      "author": "Amanda Hesser",
      "author_url": "https://food52.com/users/13-amanda-hesser",
      "date": "June 7, 2016",
      "description": "Mostly, I haven't had much reason to buy condensed milk. But a trip to Panama changed this. After a long hike in the cloud forest, our guide took us to a local place in Boquete specializing in strawberry desserts. My eye went straight to a strawberry ice capped with condensed milk and dense whipped cream. The creamy milk quietly mediated between the fruit and cream, working its magic much like it does in coffee and cookie bars. —Amanda Hesser",
      "ingredients": [
        {
          "ingredient": "24 ounces frozen strawberries (ideally sweet, fresh ones that you've frozen)"
        },
        {
          "ingredient": "3 tablespoons sugar, plus more to taste"
        },
        {
          "ingredient": "1 tablespoon lemon juice, plus more to taste"
        },
        {
          "ingredient": "1/2 cup heavy cream"
        },
        {
          "ingredient": "one 14-ounce can sweetened condensed milk"
        }
      ],
      "directions": [
        {
          "step": "In a food processor, combine the frozen strawberries, sugar, and lemon juice. Pulse until the mixture is a fluffy, powdery ice. Taste and adjust sweetness and lemon juice if needed. Pulse again. Scrape the ice into a container and freeze for at least 2 hours."
        },
        {
          "step": "Just before serving, whip the cream. Spoon the strawberry ice into 6 coupes, tumblers, or bowls. Top each with two tablespoons condensed milk and a big pouf of whipped cream. Hurry to the table!"
        }
      ]
    },
    {
      "name": "Huevos Rancheros with Blistered Tomato Salsa",
      "author": "Alexandra Stafford",
      "author_url": "https://food52.com/users/16479-alexandra-stafford",
      "date": "June 5, 2016",
      "description": "In its simplest form, huevos rancheros consists of tortillas, tomato salsa, and eggs cooked however you wish. I like poached, but fried or scrambled—whatever you like best—is fine, too.\nTortillas: I like the tortillas made from a mix of cornmeal and flour. Both Whole Foods and Trader Joe’s sell this hybrid variety, which has a nice corn flavor without a gummy texture.\nThis salsa recipe has been adapted from one in America’s Test Kitchen’s Cook It In Cast Iron.\nOf course, avocado, sour cream, and beans would all be welcomed here, but keeping it simple also keeps these huevos rancheros light and fresh-tasting. Once you have the salsa made, which will keep for several days in the fridge, these take no time to whip up.\n—Alexandra Stafford",
      "ingredients": [
        {
          "ingredient": "Blistered Tomato Salsa"
        },
        {
          "ingredient": "3 tablespoons grapeseed oil"
        },
        {
          "ingredient": "1 1/2 pounds grape tomatoes"
        },
        {
          "ingredient": "Kosher salt"
        },
        {
          "ingredient": "1 small onion, roughly chopped into 1-inch pieces"
        },
        {
          "ingredient": "1 jalapeño, stem removed, seeds left intact, quartered"
        },
        {
          "ingredient": "1 tablespoon tomato paste"
        },
        {
          "ingredient": "2 cloves garlic, smashed"
        },
        {
          "ingredient": "1/2 teaspoon teaspoon whole cumin seeds or ground cumin"
        },
        {
          "ingredient": "1/4 cup cilantro, stems and all"
        },
        {
          "ingredient": "1 tablespoon fresh lime juice, plus more wedges for serving"
        },
        {
          "ingredient": "For Serving"
        },
        {
          "ingredient": "Eggs, however many you wish"
        },
        {
          "ingredient": "Tortillas, however many you wish"
        },
        {
          "ingredient": "Grated cheese, such as Cheddar or Monterey Jack"
        },
        {
          "ingredient": "Sliced scallions, optional"
        }
      ],
      "directions": [
        {
          "step": "Heat a large cast-iron skillet over medium heat for 5 minutes. Add 1 tablespoon of the oil, the tomatoes, and 1 teaspoon kosher salt. Cook, stirring occasionally, until lightly charred and blistered, about 10 minutes. Transfer to food processor or blender but don't blend just yet."
        },
        {
          "step": "Heat remaining 2 tablespoons oil in now-empty skillet over medium heat until shimmering. Add jalapeño and onion and cook until lightly charred, about 8 minutes—it's okay if the seeds and skins are looking brown and blistered. Stir in the tomato paste, garlic, 1 teaspoon salt, and cumin and cook until fragrant, about 30 seconds. Transfer to the food processor or the blender holding the tomatoes. Add the cilantro and lime juice. Process until smooth. Set aside."
        },
        {
          "step": "Bring a medium-sized, covered pot of water to a boil. Preheat the broiler to high. Crack as many eggs you are using into individual ramekins. Remove pan of water from heat source. Drop eggs one at a time into pot. Cover pan and set aside for 3 minutes, or until whites are set but yolks are still runny—test by lifting egg from water with slotted spoon and touching gently. Transfer to a paper-towel lined plate."
        },
        {
          "step": "Meanwhile, lightly rub each tortilla with oil on each side, and set on a broiler pan or on a cooling rack set on a sheetpan. Broil for 2 minutes, watching closely, or until lightly golden. Remove pan from broiler, flip tortillas, and broil again for 1 to 2 minutes or until lightly golden. Remove pan from broiler. Top each with 2 tablespoons of the salsa. Top each with a poached egg. Sprinkle with cheese to taste. Return pan to broiler and cook 1 to 2 minutes or until cheese has melted."
        },
        {
          "step": "Remove pan from oven. Sprinkle with scallions, if using, and serve with lime wedges and more salsa on the side."
        }
      ]
    },
    {
      "name": "Zuni Café Bread Salad with Currants, Pine Nuts, Scallions & Roasted Chicken",
      "author": "Kenzi Wilbur",
      "author_url": "https://food52.com/users/26633-kenzi-wilbur",
      "date": "June 1, 2016",
      "description": "This recipe comes from Zuni Café via Smitten Kitchen. For the roasted chicken, we like to use Barbara Kafka's Simplest Roast Chicken. Time your chicken so that it comes out of the oven while the bread is still warm. —Kenzi Wilbur",
      "ingredients": [
        {
          "ingredient": "8 ounces slightly stale open-crumbed, chewy, peasant-style bread (not sourdough)"
        },
        {
          "ingredient": "6 tablespoons to 8 tablespoons mild-tasting olive oil"
        },
        {
          "ingredient": "1 1/2 tablespoons Champagne vinegar or white wine vinegar"
        },
        {
          "ingredient": "1 pinch salt and freshly cracked black pepper"
        },
        {
          "ingredient": "2 teaspoons pine nuts"
        },
        {
          "ingredient": "2 to 3 garlic cloves, slivered"
        },
        {
          "ingredient": "1/4 cup slivered scallions (about 4 scallions), including a little of the green part"
        },
        {
          "ingredient": "1 tablespoon dried currants plumped in 1 tablespoon red wine vinegar and 1 tablespoon warm water for 10 minutes or so"
        },
        {
          "ingredient": "2 tablespoons lightly salted chicken stock or lightly salted water"
        },
        {
          "ingredient": "1 roasted chicken (we like Barbara Kafka's: https://food52.com/recipes...)"
        },
        {
          "ingredient": "3 handfuls A few handfuls of arugula, frisée, or red mustard greens, carefully washed and dried"
        }
      ],
      "directions": [
        {
          "step": "Preheat the broiler. Carve off all of the bottom and most of the top and side crusts from your bread (you can reserve these to use as croutons for soup or another salad). Tear bread into irregular 2- to 3-inch chunks—you should get about 4 cups."
        },
        {
          "step": "Toss them with a tablespoon or two of olive oil, lightly coating them, and broil very briefly, just to lightly color the edges. If you’d like to toast the pine nuts (recommended) you can put them on your broiler tray as well, but watch them very carefully because they cook quickly!"
        },
        {
          "step": "Combine about 1/4 cup of the olive oil with the Champagne or white wine vinegar and salt and pepper to taste. Toss about 1/4 cup of this tart vinaigrette with the torn toasted bread in a wide salad bowl; the bread will be unevenly dressed. Taste one of the more saturated pieces. If it is bland, add a little salt and pepper and toss again."
        },
        {
          "step": "Heat a spoonful of the olive oil in a small skillet, add the garlic and scallions, and cook over medium-low heat, stirring constantly, until softened. Don’t let them color. Scrape into the bread and fold to combine. Drain the plumped currants and fold them in, along with the pine nuts, if they were not already mixed with the bread scraps from the broiling step. Dribble the chicken stock or lightly salted water over the salad and fold again."
        },
        {
          "step": "Taste a few pieces of bread—a fairly saturated one and a dryish one. If it is bland, add salt, pepper, and/or a few drops of vinegar, then toss well. When the chicken comes out of the oven, drizzle the bread with a spoonful or two more of chicken pan juices and toss. Add the greens, a drizzle of vinaigrette, and fold well. Taste again."
        },
        {
          "step": "Pile the bread salad on the serving dish. Carve the roast chicken and plunk the pieces on top of the salad, using more pan juices to moisten the bread as needed."
        }
      ]
    },
    {
      "name": "Simplest Stovetop Rhubarb Compote",
      "author": "Sarah Jampel",
      "author_url": "https://food52.com/users/124167-sarah-jampel",
      "date": "May 31, 2016",
      "description": "Sometimes you want to eat rhubarb without making a cake, rolling out dough for a galette, or trying to figure out what the heck hazelnut frangipane is. For those times, turn to this 4-ingredient, 15-minute compote. It comes from Molly WIzenberg of Orangette, who adapted it from pastry chef Dana Cree. —Sarah Jampel",
      "ingredients": [
        {
          "ingredient": "1 pound (455 grams) rhubarb, trimmed and cut into roughly 3/4-inch chunks"
        },
        {
          "ingredient": "1/2 to 3/4 cups (100 to 150 grams) sugar"
        },
        {
          "ingredient": "2 tablespoons (28 grams) salted butter (or use unsalted and add a pinch of salt)"
        },
        {
          "ingredient": "2 tablespoons orange liqueur, like Cointreau or Grand Marnier"
        }
      ],
      "directions": [
        {
          "step": "In a medium bowl, mix the rhubarb with the sugar."
        },
        {
          "step": "In a heavy medium saucepan over medium heat, melt the butter. When the butter has melted, add the rhubarb and sugar mixture and the orange liqueur."
        },
        {
          "step": "Allow to cook, undisturbed, for 2 minutes. Then gently stir and continue to cook, stirring occasionally, until the rhubarb is tender and beginning to fall apart and its juices are thick, 10 to 15 minutes."
        },
        {
          "step": "Store in an airtight container in the refrigerator for up to 1 week."
        }
      ]
    },
    {
      "name": "Za'atar Grilled Chicken Wings with Fava Bean Feta Dip",
      "author": "MariaR",
      "author_url": "https://food52.com/users/986418-mariar",
      "date": "May 30, 2016",
      "description": "WHO: Maria Rivera is a brand-new Food52 community member (and a pediatrician!). She lives in D.C.\nWHAT: Chicken wings with all the thyme (well, za'atar) in the world.\nHOW: Marinate chicken wings overnight in a Middle Eastern-inspired spice blend. Coat with za'atar, grill, and serve sprinkled with *more* za'atar and a creamy fava-feta dip.\nWHY WE LOVE IT: Yes, you have to marinate these wings overnight—but they are indeed all the better for it, and afterwards, need only a quick spell on the grill. Paired with the fava-feta dip, they're our new favorite way to make wings: totally unexpected, perfectly matched with the dip, and a little bit spicy. And, might we add, a welcome, refreshing, herby departure from sticky-sweet wings. —The Editors",
      "ingredients": [
        {
          "ingredient": "Chicken Wings"
        },
        {
          "ingredient": "1 tablespoon sumac"
        },
        {
          "ingredient": "1/2 teaspoon allspice"
        },
        {
          "ingredient": "1/4 teaspoon cinnamon"
        },
        {
          "ingredient": "1 1/2 teaspoons salt"
        },
        {
          "ingredient": "1 cup water"
        },
        {
          "ingredient": "2 red onions, thinly sliced"
        },
        {
          "ingredient": "3 garlic cloves, crushed"
        },
        {
          "ingredient": "1/4 teaspoon ground black pepper"
        },
        {
          "ingredient": "3 tablespoons olive oil"
        },
        {
          "ingredient": "Juice of 1 large lemon"
        },
        {
          "ingredient": "24 pieces chicken wings, both drumsticks and wings"
        },
        {
          "ingredient": "4 tablespoons za'atar"
        },
        {
          "ingredient": "Fava Bean Feta Dip"
        },
        {
          "ingredient": "1 1/2 cups frozen fava beans (with shell, or 1/2 cup shelled)"
        },
        {
          "ingredient": "1 cup labneh (can sub for full-fat Greek yogurt or sour cream)"
        },
        {
          "ingredient": "3 ounces feta (I used goat feta, can use normal feta also)"
        },
        {
          "ingredient": "Juice of half of a lemon"
        }
      ],
      "directions": [
        {
          "step": "In a large bowl, make the marinade by mixing the spices (with the exception of the za'atar), water, red onions, garlic, olive oil, and lemon juice together."
        },
        {
          "step": "Add the chicken wings, coat in the marinade, and let sit in the marinade in the refrigerator for at least overnight. We left it marinating for 24 hours and are convinced that was even better."
        },
        {
          "step": "Heat the grill to 400° F."
        },
        {
          "step": "Drain the marinade. Add 3 tablespoons of za'atar and mix together until wings are coated (add more as needed to coast the wings)."
        },
        {
          "step": "Grill the wings for about 25 minutes, flipping over once or twice halfway. Once cooked, remove from the heat, sprinkle with another tablespoon of za'atar."
        },
        {
          "step": "Enjoy with dip outlined below!"
        },
        {
          "step": "If they still have the shell, boil the fava beans for 8 to 10 minutes until soft. Then shell and throw out the shells. If already shelled, then can boil for only 4 minutes. Drain."
        },
        {
          "step": "Blend the boiled fava beans, labneh, feta, and juice of half of a lemon using a blender or food processor until smooth. Store any extras in an airtight container in the refrigerator for up to 3 days."
        }
      ]
    },
    {
      "name": "Yogurt White Chocolate",
      "author": "Alice Medrich",
      "author_url": "https://food52.com/users/64637-alice-medrich",
      "date": "May 29, 2016",
      "description": "For those of you on the fence about the merits of white chocolate in the first place—adding a hint of tangy yogurt may be all it takes to knock you over. Yogurt may be the magic ingredient that makes white chocolate actually (finally!) delicious enough to take seriously; of course, you didn’t hear that from me… —Alice Medrich",
      "ingredients": [
        {
          "ingredient": "3 1/2 ounces (100 grams) white chocolate: do not use white chocolate chips, white compound coating, or candy melts"
        },
        {
          "ingredient": "2 to 4 teaspoons (7 to 14 grams) yogurt powder (I used Hoosier Hill Farms)"
        },
        {
          "ingredient": "A few grams of cocoa butter or drops of neutral vegetable oil (sunflower, or safflower etc), optional as needed to adjust the consistency"
        }
      ],
      "directions": [
        {
          "step": "Chop the chocolate finely with a dry knife on a dry cutting board and put it in a dry stainless steel bowl. Add 2 teaspoons (7 grams) of the yogurt powder."
        },
        {
          "step": "Bring a wide skillet of water to a simmer. Remove the skillet from the burner and wait 60 seconds. Then set the bowl of chocolate directly in the water and stir frequently until the chocolate is melted and warm (not hot) to the touch. Taste and add more yogurt powder, if you like. Some chocolates are thicker than others when melted, and the yogurt powder also increases viscosity slightly: If the chocolate is too thick for your application, thin it by adding melted cocoa butter or vegetable oil, a drop at time, stirring well, until the chocolate is the desired consistency for dipping, drizzling, or what-you-will."
        },
        {
          "step": "(To make the yogurt chocolate in a microwave, put the chopped chocolate and yogurt powder in a microwave-safe bowl and heat on low or defrost: Start with 1 to 2 minutes. Stir the chocolate well, even if most of it is still unmelted, and return it to microwave in increments of 5 to 15 seconds or more each time, depending on how much of the chocolate is still unmelted each time, stirring after each increment."
        },
        {
          "step": "Use the yogurt chocolate immediately—to coat strawberries or cherries or whatever project you have in mind. Or you can temper it before you use it. Scrape leftover yogurt chocolate onto a sheet of foil or wax or parchment paper and let it harden at room temperature. Wrap it airtight and store it for another use. Re-melt or re-temper as necessary."
        }
      ]
    },

    {
      "name": "Pretzel for a Crowd",
      "author": "Erin McDowell",
      "author_url": "https://food52.com/users/3572-erin-mcdowell",
      "date": "May 23, 2016",
      "description": "A fun thing to do with pretzel dough: Make one big pretzel to serve a crowd! There's really no wrong way to intertwine the strands; just be sure to leave some space between pieces of dough while you work, or they'll rise and bake together and it won't look as pretzel-y! Oh, and don't forget the mustard. —Erin McDowell",
      "ingredients": [
        {
          "ingredient": "Dough"
        },
        {
          "ingredient": "22.80 ounces bread flour (5 1/2 cups)"
        },
        {
          "ingredient": "9 grams active dry yeast (1 tablespoon)"
        },
        {
          "ingredient": "11 grams kosher salt (2 1/2 teaspoons)"
        },
        {
          "ingredient": "349 grams warm water, 95 to 100° Fahrenheit (1 1/4 cup plus 1 tablespoon)"
        },
        {
          "ingredient": "57 grams unsalted butter, softened (4 tablespoons)"
        },
        {
          "ingredient": "23 grams granulated sugar (2 tablespoons)"
        },
        {
          "ingredient": "Finishing"
        },
        {
          "ingredient": "1.25 ounces lye"
        },
        {
          "ingredient": "22 ounces boiling water (2 3/4 cup)"
        },
        {
          "ingredient": "12 ounces cold water (1 1/2 cup)"
        },
        {
          "ingredient": "Coarse salt, for finishing (I like Maldon)"
        }
      ],
      "directions": [
        {
          "step": "In the bowl of an electric mixer fitted with the dough hook attachment, mix the flour, sugar, yeast, and salt to combine."
        },
        {
          "step": "Add the water and butter and mix on low speed until the dough comes together, 3 minutes."
        },
        {
          "step": "Raise the speed to medium high and continue to mix until the dough is very smooth, 4 minutes more."
        },
        {
          "step": "Transfer the dough to a large bowl lightly greased with nonstick spray. Cover loosely with plastic wrap and let rise at room temperature until doubled in size, about 1 to 1 1/2 hours."
        },
        {
          "step": "Turn the dough out onto a lightly floured surface. Divide the dough into 10 even pieces (about 3 ounces each). Cover the dough loosely with greased plastic wrap on your work surface and let rest for 15 to 20 minutes"
        },
        {
          "step": "Line a baking sheet with parchment paper. I like to use the bottom of the baking sheet so there’s no edges getting in the way (or you can opt for a totally flat cookie sheet if you’ve got one!"
        },
        {
          "step": "Start by making the outer ring: You’ll use 3 pieces of dough, so start by gently pressing them together a bit. Press the dough into a slightly oblong shape, just by pushing it flat with your fingers. Start at the top of the dough (the end farthest away from you), and fold one third of the piece of dough over onto itself. Press firmly with your fingertips or with the heel of your hand to \"seal.\" Continue to fold the dough over and press to seal until it has formed a log shape."
        },
        {
          "step": "Starting with very light pressure in the center of the dough, roll the dough between your hands and the work surface, elongating the log. Roll until the strand is evenly about 1/3 inch in circumference. Form the strand into a large ring on the prepared baking sheet, and press the ends together where they meet to seal."
        },
        {
          "step": "Now it’s time to shape the inside. First, shape each piece of dough as described above, folding it over onto itself and sealing with your fingers or the heel of your hand, then rolling into a strand. I usually build from the outside in: I start with a round shape with the first piece of dough. Next, I twist another piece of dough around a portion of that circle so that they are connected, then I make it into a round too. Make sure each piece of dough is touching (or even twisted partially around) the outer ring. It doesn’t have to be twisted, though; if it’s touching, it will rise together, bake together, and stay together (promise)! Really, anything goes here—just intertwine the last 7 dough strands together to make twists, rounds, and such until you’ve got one big pretzel!"
        },
        {
          "step": "Cover the pretzel with greased plastic wrap and let it rise for 30 minutes to 1 hour."
        },
        {
          "step": "While the dough rises, prepare your lye solution. Wear gloves and eye protection! Place the lye in a large, non-reactive, heat-safe bowl. Pour the boiling water over the lye, taking care not to inhale the steam that emits from the lye. Wait 1 minute, then add the cold water to the mixture, and cool a bit (or all the way to room temperature)."
        },
        {
          "step": "Preheat the oven to 425° Fahrenheit. Use a pastry brush to generously brush the entire surface and sides of the dough with the lye solution—I usually do it twice to make sure I didn’t miss a spot. Top generously with coarse salt."
        },
        {
          "step": "Bake until the pretzel is deeply golden brown, 25 to 30 minutes (if you’re not sure if it’s done, you can always take an internal temp; it should be around 185° Fahrenheit. Cool at least 15 minutes before serving with mustard and beer!"
        }
      ]
    },
    {
      "name": "The Lucien Gaudin",
      "author": "fiveandspice",
      "author_url": "https://food52.com/users/10300-fiveandspice",
      "date": "May 18, 2016",
      "description": "A vintage cocktail that has been unearthed. This one is named after a French fencing champion! It balances out the dry herbal notes of gin and dry vermouth with some Cointreau and Campari. One of my go-tos for an elegant, boozy cocktail when I want something sweeter than a martini but drier than a Negroni (an important niche to fill!). —fiveandspice",
      "ingredients": [
        {
          "ingredient": "1 ounce London dry-style gin"
        },
        {
          "ingredient": "1/2 ounce Dolin dry vermouth"
        },
        {
          "ingredient": "1/2 ounce Cointreau"
        },
        {
          "ingredient": "1/2 ounce Campari"
        },
        {
          "ingredient": "A strip of lemon peel with no zest"
        }
      ],
      "directions": [
        {
          "step": "Stir all the ingredients with ice until well chilled and diluted, about 30 seconds (yes, you can count one one-thousand, two one-thousand in your head while you stir). Strain into a coupe. Hold the piece of lemon peel in your fingers and roll it between them over the top of the cocktail, expressing the citrus oil onto the cocktail. Discard the lemon peel and drink."
        }
      ]
    },
    {
      "name": "Fresh Raw Pea, Asparagus & Fava Bean Salad with Herbs & Pecorino",
      "author": "Sara Jenkins",
      "author_url": "https://food52.com/users/225-sara-jenkins",
      "date": "May 16, 2016",
      "description": "If you don’t have access to super fresh local farm produce I would probably blanch and shuck the fava beans, blanch the peas or substitute snap peas and blanch the asparagus and cut it into small 2 “ lengths. —Sara Jenkins",
      "ingredients": [
        {
          "ingredient": "3 pounds fresh fava beans (removed from pods)"
        },
        {
          "ingredient": "1/2 cup cup fresh shucked peas or 1 pound snap peas, blanched"
        },
        {
          "ingredient": "5 stalks fat fresh asparagus"
        },
        {
          "ingredient": "2 1/2 cups fresh herb mix using at least 3 of the following: mint, parsley, sorrel, pea shoots, tarragon, chives, lovage"
        },
        {
          "ingredient": "6 ounces pecorino cheese (my preference is for a medium-aged Tuscan pecorino)"
        },
        {
          "ingredient": "1/2 teaspoon fleur de sel or other fine finishing salt"
        },
        {
          "ingredient": "Black pepper"
        },
        {
          "ingredient": "1/4 cup cup finest estate-bottled extra-virgin olive oil"
        }
      ],
      "directions": [
        {
          "step": "Mix the favas and peas together in a bowl. Trim the asparagus of its tough woody ends and shave paper-thin using a mandolin. Add the herb leaves and roughly chunk up the Pecorino into misshapen pieces. Add to the bowl, sprinkle with the salt, black pepper, and olive oil and toss gently. Eat immediately"
        }
      ]
    },
    {
      "name": "Peacock Alley's Across The Border Cocktail",
      "author": "Samantha Weiss Hills",
      "author_url": "https://food52.com/users/173133-samantha-weiss-hills",
      "date": "May 15, 2016",
      "description": "This cocktail comes from Frank Caiafa, the bar manager for Peacock Alley at the Waldorf Astoria Hotel. This delicious and herbal update on the margarita is included in the reissued Waldorf Astoria Bar Book. The ratios are balanced and flavorful, strong but not overpowering, and it's easy to scale up for a crowd. —Samantha Weiss Hills",
      "ingredients": [
        {
          "ingredient": "3 ounces mezcal (Sombra is suggested)"
        },
        {
          "ingredient": "1 ounce Averna amaro"
        },
        {
          "ingredient": "1 1/2 ounces fresh grapefruit juice"
        },
        {
          "ingredient": "2/3 ounce lime juice"
        },
        {
          "ingredient": "4 ounces ginger beer (Fever Tree or Q is suggested)"
        }
      ],
      "directions": [
        {
          "step": "Add all ingredients except ginger beer to shaker. Add ice and shake well."
        },
        {
          "step": "Strain into a Collins glass filled with large ice cubes. Add ginger beer and stir briefly to integrate. Garnish with a lime wedge."
        }
      ]
    },
    {
      "name": "Larb Gai (Thai Chicken Salad)",
      "author": "Alexandra Stafford",
      "author_url": "https://food52.com/users/16479-alexandra-stafford",
      "date": "May 12, 2016",
      "description": "This recipe is inspired by the Larb Gai at Summer Summer Thai Eatery in Emeryville, California. I ate it nearly every day for lunch for about 2 weeks, and I never tired of it—it was fresh, light, and satisfying. Summer Summer's larb is seasoned with toasted rice powder, which is so good, though I haven't missed it in my homemade larb—the herbs, shallots, scallions, and lime dressing provide plenty of flavor. I've been serving it as they do at Summer Summer (and many other Thai eateries) with steamed brown rice and lettuce leaves on the side.\nRecipe adapted from this Bon Appétit recipe. —Alexandra Stafford",
      "ingredients": [
        {
          "ingredient": "1 pound ground chicken (I've been grinding thighs at home)"
        },
        {
          "ingredient": "1/3 cup fresh lime juice, from about 2 limes"
        },
        {
          "ingredient": "2 tablespoons + 2 teaspoons fish sauce"
        },
        {
          "ingredient": "1 1/2 teaspoons sugar"
        },
        {
          "ingredient": "1 cup thinly sliced scallions"
        },
        {
          "ingredient": "3/4 cup thinly sliced shallots"
        },
        {
          "ingredient": "1 tablespoon thinly sliced hot chili such as Thai bird, Serrano, or jalapeño or more to taste"
        },
        {
          "ingredient": "1/2 cup roughly chopped cilantro"
        },
        {
          "ingredient": "1/4 cup finely chopped mint"
        },
        {
          "ingredient": "Lettuce cups for serving: romaine, Little Gem, or Boston"
        },
        {
          "ingredient": "Steamed rice for serving"
        }
      ],
      "directions": [
        {
          "step": "Place the chicken and 1/4 cup water in a large skillet over medium heat. Cook, stirring occasionally to break up any clumps of meat, until the chicken is cooked through, about 8 minutes—you don’t want to brown the chicken, so lower heat as needed."
        },
        {
          "step": "Meanwhile, stir together the lime juice, fish sauce, and sugar in a small bowl, until the sugar is dissolved. Set aside."
        },
        {
          "step": "Add scallions, shallots, and chili to skillet, and cook over low heat just until the vegetables are tender and most of the liquid has evaporated, 3 to 4 minutes. Remove from heat. Stir in the sauce, cilantro, and mint, and toss to coat."
        },
        {
          "step": "Serve the larb with the lettuce leaves and rice on the side."
        }
      ]
    },
    {
      "name": "Sam Fromartz' Sourdough Starter",
      "author": "Sam Fromartz",
      "author_url": "https://food52.com/users/12492-sam-fromartz",
      "date": "May 11, 2016",
      "description": "To make a sourdough starter, you should realize you are a farmer, not a cook! You are creating the conditions for your microscopic animals to live happily. If you keep that in mind, the process will go a little smoother. I use organic whole rye flour because it’s an especially active medium for fermentation. It has higher levels of sugar than wheat to feed wild yeasts; it also has more amylase enzymes to break down starch and create yet even more sources of sugar for these tiny organisms.\nI also use raw (unpasteurized) honey, as a nod to Pliny the Elder from the 1st Century, who mentions it while writing about bakers and sourdough fermentation in the Roman Empire, and because it’s the most concentrated source of natural sugar found in nature. Plus, raw honey contains wild yeast. One word of warning: Avoid glass jars, unless you cover them loosely. If sealed, they can explode while fermenting.\nExcerpted from In Search of the Perfect Loaf: A Home Baker’s Odyssey (Viking, 2014). Reprinted with permission. For more of Sam Fromartz' writing, click here. —Sam Fromartz",
      "ingredients": [
        {
          "ingredient": "Tools"
        },
        {
          "ingredient": "8- or 16-ounce plastic or ceramic container with lid"
        },
        {
          "ingredient": "Spoon"
        },
        {
          "ingredient": "Starter"
        },
        {
          "ingredient": "Organic whole rye flour"
        },
        {
          "ingredient": "Raw honey"
        },
        {
          "ingredient": "Filtered or spring water (so bacteria-killing chlorine is removed)"
        }
      ],
      "directions": [
        {
          "step": "Mix 3 tablespoons (30 grams) lukewarm water (about 80 to 90˚F) with 1 teaspoon raw honey. Add 3 tablespoons (20 grams) rye flour and let this sit in a covered container for 1 to 2 days. The amount of time depends on the ambient temperature. If your kitchen is cool, the organisms will be less active and you’ll need more time. Ideally keep it at around 75˚F (24˚C). An oven with the lights or pilot light on works well."
        },
        {
          "step": "If you can maintain an ambient temperature of 75°F (24˚C), this first phase will probably take a day, which would be the case on your kitchen counter in the summer. If you simply ferment it in a cold kitchen in winter, it will likely take two days. When you pass by the starter, give it a mix with a spoon every now and again: your animals like oxygen in the initial stages. If they are happy, you will begin to see tiny bubbles forming on the surface of the starter as the organisms belch out carbon dioxide. This should occur after one or two days."
        },
        {
          "step": "At this point, add 3 tablespoons of rye flour, 3 tablespoon of water around 75˚F (24˚C), and 1 teaspoon honey. Let it sit for 24 hours. Stir occasionally."
        },
        {
          "step": "Discard half the starter. Add 3 tablespoons of rye, 3 tablespoons of water, and 1 teaspoon honey."
        },
        {
          "step": "Repeat this last step every 24 hours until the starter is bubbly and begins to rise noticeably. Once that happens, usually by day 5 or 6, you can stop adding the honey. The starter may weaken at that point (you’ve removed its sugar fix, after all) but proceed anyway. It will come alive again. When the mixture doubles in volume within 12 hours, you can think about making bread."
        },
        {
          "step": "Here’s the test to see if the starter is ready, after it has risen: carefully remove a bit of it (a tablespoon will do) and place it in bowl of warm water. If it floats to the surface within a couple of minutes, you’ve got an active starter."
        },
        {
          "step": "This whole process may take a week or more, especially in the winter. With my kitchen hovering around 65˚F (18˚C), it took me two weeks to achieve a predictable starter, with feedings every one to two days. Once the starter is bubbly and active, you can switch to whole wheat flour, or a mixture of equal parts white and whole wheat flour, in place of the rye. You can also increase the volume by using, say, 20 grams of the mature starter and then feeding it with 100 grams flour and 100 grams water."
        },
        {
          "step": "TROUBLESHOOTING: You may start out and get bubbles, but by day two or three it just looks dead. You have a few options:"
        },
        {
          "step": "First, keep going, and eventually the yeast and bacteria will re-appear and the starter will rise. An active, robust culture is nearly impossible to kill, even if you do leave it around on the kitchen counter for a few days. So if you forget it feed it for a couple of days, don’t throw it out—just soldier on and see what happens."
        },
        {
          "step": "Second, you can replace the water with pineapple or apple juice to raise the acidity level, which creates a favorable environment for wild yeast."
        },
        {
          "step": "Third, start over. If you do decide to start over, try to acidify the starter by using juice in place of water or a pinch of vitamin C powder with the water for the first three days."
        },
        {
          "step": "Fourth, use a pinch of commercial yeast (really, just a pinch between your thumb and forefinger) to jump start your sourdough. Although it may feel like “cheating,” there’s really nothing wrong with this method. Once your starter becomes sufficiently acidic over time, the wild yeast and bacteria will outcompete the store-bought yeast and your starter will be much the same as if you started out without it."
        },
        {
          "step": "If all else fails, here is a guaranteed method: Ask for a knob of starter from a friend or local artisan baker (it helps to mention how wonderful their breads are). You may also get a few tips along the way. Feed it once or twice daily by taking 20 grams of the starter and adding 100 grams flour and 100 grams water and leaving it, ideally, at around 75˚F (24˚C) for about 6 to 8 hours. Refrigerate it an hour or two after feeding if you’re not going to use it within the next day. If kept in the refrigerator for a week or longer, refresh it at least once before using it to rise bread. I often refresh it twice, just to ensure it’s sufficiently strong."
        },
        {
          "step": "VARIATIONS: I tend to reuse a very small portion of my existing starter when it’s feeding time. I use 20 grams existing starter, 100 grams flour, and 75 grams water. This makes a stiff starter which rises slowly, especially in the winter. After eight hours it can be used, and will tend to have a very mild lactic acid taste."
        }
      ]
    },
    {
      "name": "Milk Toast",
      "author": "Sarah E Daniels",
      "author_url": "https://food52.com/users/864391-sarah-e-daniels",
      "date": "May 9, 2016",
      "description": "Adapted from M.F.K. Fisher's milk toast recipe. —Sarah E Daniels",
      "ingredients": [
        {
          "ingredient": "2 thick slices of firm, hearty bread (like white or sourdough)"
        },
        {
          "ingredient": "2 cups creamy whole milk"
        },
        {
          "ingredient": "Butter, for toast"
        },
        {
          "ingredient": "Cinnamon and sugar or brown sugar, to taste"
        }
      ],
      "directions": [
        {
          "step": "Warm two bowls."
        },
        {
          "step": "Toast the bread well and butter slices generously."
        },
        {
          "step": "Cut the toast into cubes and divide evenly between the two bowls."
        },
        {
          "step": "Meanwhile, warm the milk until simmering and season with cinnamon and sugar as desired."
        },
        {
          "step": "Pour the warm milk over the toast and serve immediately."
        },
        {
          "step": "Eat like cereal."
        }
      ]
    }
  ]
}
